deeprfid/Scanner_Decoder/hc32f46_driver/trunk/user/src/readercfg.c
#include <string.h>
#include <stdlib.h>
#include "hc32f46_driver.h"
#include "driverconfig.h"
#include "readercfg.h"
#include "json-parser.h"
#include "common.h"

void set_eastag_to_flash(void); 
const uint8 DefIpAddr[] = {192, 168, 0, 120};
const uint8 DefSubnetMask[] = {255, 255, 255, 0};
const uint8 DefGateWay[] = {192, 168, 0, 1};
const uint8 DefDnsServer[] = {223, 6, 6, 6};
const uint8 DefMac[6] = {0x1E, 0x30, 0x6C, 0xA2, 0x45, 0x5E};
//const uint8 DefMac[6] = {0x08, 0x26, 0xAE, 0x10, 0x00, 0x00};
const uint16 DefTcpPort = 8080;
//#define NetConfig_Len 24

int pre_set_config(ConfReadBuffer *pbuffer)
{
	pbuffer->netcfgbuf = malloc_hexp(MaxNetConfigLen);
	pbuffer->wificfgbuf = malloc_hexp(MaxWifiConfigLen);
	pbuffer->hwtypecfgbuf = malloc_hexp(MaxHwTypeConfigLen);
	pbuffer->monetcfgbuf = malloc_hexp(MaxMonetConfigLen);
	pbuffer->bluetoothcfgbuf = malloc_hexp(MaxBluetoothConfigLen);
	pbuffer->activemodecfgbuf = malloc_hexp(MaxActiveModeConfigLen);
	pbuffer->workmodeparambuf = malloc_hexp(MaxWorkModeParamLen);
	pbuffer->passivemodecfgbuf = malloc_hexp(MaxPassiveModeConfigLen);
	pbuffer->bootcfgbuf = malloc_hexp(MaxBootConfigLen);
	
	if (pbuffer->netcfgbuf == NULL || pbuffer->activemodecfgbuf== NULL || 
		pbuffer->bootcfgbuf == NULL || pbuffer->passivemodecfgbuf == NULL || 
		pbuffer->workmodeparambuf == NULL || pbuffer->bluetoothcfgbuf == NULL || 
		pbuffer->monetcfgbuf == NULL)
	{
		TRACE("set_network_config:no enough memory\n");
		return -1;
	}
	
	flash_bytes_read(NetConfig_Addr, pbuffer->netcfgbuf, MaxNetConfigLen);
	flash_bytes_read(WifiConfig_Addr, pbuffer->wificfgbuf, MaxWifiConfigLen);
	flash_bytes_read(HwTypeConfig_Addr, pbuffer->hwtypecfgbuf, MaxHwTypeConfigLen);
	flash_bytes_read(MonetConfig_Addr, pbuffer->monetcfgbuf, MaxMonetConfigLen);
	flash_bytes_read(BluetoothConfig_Addr, pbuffer->bluetoothcfgbuf, MaxBluetoothConfigLen);
	flash_bytes_read(ActiveModeConfig_Addr, pbuffer->activemodecfgbuf, MaxActiveModeConfigLen);
	flash_bytes_read(WorkModeParams_Addr, pbuffer->workmodeparambuf, MaxWorkModeParamLen);
	flash_bytes_read(PassiveModeConfig_Addr, pbuffer->passivemodecfgbuf, MaxPassiveModeConfigLen);
	flash_bytes_read(BootConfig_Addr, pbuffer->bootcfgbuf, MaxBootConfigLen);
	
	return 0;
}

int set_config_to_flash(ConfReadBuffer *pbuffer)
{
	int err = 0;
	E(flash_sector_erase(RdrConfigPage_Addr));
	E(flash_bytes_write(NetConfig_Addr, pbuffer->netcfgbuf, MaxNetConfigLen));
	E(flash_bytes_write(WifiConfig_Addr, pbuffer->wificfgbuf, MaxWifiConfigLen));
	E(flash_bytes_write(HwTypeConfig_Addr, pbuffer->hwtypecfgbuf, MaxHwTypeConfigLen));
	E(flash_bytes_write(MonetConfig_Addr, pbuffer->monetcfgbuf, MaxMonetConfigLen));
	E(flash_bytes_write(BluetoothConfig_Addr, pbuffer->bluetoothcfgbuf, MaxBluetoothConfigLen));
	E(flash_bytes_write(ActiveModeConfig_Addr, pbuffer->activemodecfgbuf, MaxActiveModeConfigLen));
	E(flash_bytes_write(WorkModeParams_Addr, pbuffer->workmodeparambuf, MaxWorkModeParamLen));
	E(flash_bytes_write(PassiveModeConfig_Addr, pbuffer->passivemodecfgbuf, MaxPassiveModeConfigLen));
	E(flash_bytes_write(BootConfig_Addr, pbuffer->bootcfgbuf, MaxBootConfigLen));
	
FIN:
	free_hexp(pbuffer->netcfgbuf);
	free_hexp(pbuffer->wificfgbuf);
	free_hexp(pbuffer->hwtypecfgbuf);
	free_hexp(pbuffer->monetcfgbuf);
	free_hexp(pbuffer->bluetoothcfgbuf);
	free_hexp(pbuffer->activemodecfgbuf);
	free_hexp(pbuffer->workmodeparambuf);
	free_hexp(pbuffer->passivemodecfgbuf);
	free_hexp(pbuffer->bootcfgbuf);
	return err;
}

int set_multi_config(uint8 *netBytes, int netLen, 
	uint8 *pasveBytes, int pasveLen, uint8 *actBytes, int actLen)
{
	int err = 0;
	ConfReadBuffer confBuf;
	
	E(pre_set_config(&confBuf));
	if (netBytes != NULL)
		memcpy(confBuf.netcfgbuf, netBytes, netLen);
	if (pasveBytes != NULL)
		memcpy(confBuf.passivemodecfgbuf, pasveBytes, pasveLen);
	if (actBytes != NULL)
	{
		/*
		int i;
		printf("set_multi_config wdata:");
		for (i = 0; i < 20; ++i)
			TRACE("%02X ", actBytes[i]);
		printf("\n");
		*/
		memcpy(confBuf.activemodecfgbuf, actBytes, actLen);
	}
	
	E(set_config_to_flash(&confBuf));
FIN:
	return err;	
}

void set_default_network_config(void)
{
	networkParaConfig networkPara;
	memset(&networkPara, 0, sizeof(networkPara));
	get_network_config(&networkPara);
	memcpy(networkPara.ip, DefIpAddr, 4);
	memcpy(networkPara.subnetMask, DefSubnetMask, 4);
	memcpy(networkPara.gatewayIP, DefGateWay, 4);
	if (!(networkPara.mac[0] == SilionMACBase1 && 
		networkPara.mac[1] == SilionMACBase2 && 
			networkPara.mac[2] == SilionMACBase3 && 
		(networkPara.mac[3] & 0xF0) == SilionMACBase4))
		memcpy(networkPara.mac, DefMac, 6);

	networkPara.listenPort = DefTcpPort;
	memcpy(networkPara.dnsServer, DefDnsServer, 4);
	set_network_config(&networkPara);
}

int set_network_config(networkParaConfig *para)
{
	int pos;
	int err = 0;
	ConfReadBuffer confBuf;
	
	E(pre_set_config(&confBuf));

	if (para->listenPort == 0)
		para->listenPort = DefTcpPort;
	if (para->dnsServer[0] == 0x00 && para->dnsServer[1] == 0x00 && 
		para->dnsServer[2] == 0x00 && para->dnsServer[3] == 0x00)
		memcpy(para->dnsServer, DefDnsServer, 4);
	
	strcpy((char *)confBuf.netcfgbuf, NetConfig_Marker);
	pos = strlen(NetConfig_Marker);
	memcpy(confBuf.netcfgbuf+pos, para->ip, 4);
	pos += 4;
	memcpy(confBuf.netcfgbuf+pos, para->subnetMask, 4);
	pos += 4;
	memcpy(confBuf.netcfgbuf+pos,  para->gatewayIP, 4);	
	pos += 4;
	
	if (!(confBuf.netcfgbuf[pos] == SilionMACBase1 && 
		confBuf.netcfgbuf[pos+1] == SilionMACBase2 && 
			confBuf.netcfgbuf[pos+2] == SilionMACBase3 && 
		(confBuf.netcfgbuf[pos+3] & 0xF0) == SilionMACBase4))
		memcpy(confBuf.netcfgbuf+pos, para->mac, 6);
	pos += 6;
	
	SetNumU16((uint8*)confBuf.netcfgbuf+pos, para->listenPort);
	pos += 2;
	memcpy(confBuf.netcfgbuf+pos, para->dnsServer, 4);
	pos += 4;
	
	E(set_config_to_flash(&confBuf));
	
FIN:
	return err;
}

void get_passivemode_config(int offset, uint8 *pData, int len)
{
	flash_bytes_read(PassiveModeConfig_Addr+offset, pData, len);
}

int set_passivemode_config(int offset, uint8 *pData, int len)
{
	int err = 0;
	ConfReadBuffer confBuf;
	
	E(pre_set_config(&confBuf));
	memcpy(confBuf.passivemodecfgbuf+offset, pData, len);
	E(set_config_to_flash(&confBuf));
FIN:
	return err;	
}

int get_network_config(networkParaConfig *para)
{
//	int i;
	int pos;
	uint8 *netcfgbuf = malloc_hexp(MaxNetConfigLen);
	
