deeprfid/Scanner_Decoder/hc32f46_driver/trunk/user/src/readercfg.c
	if (netcfgbuf == NULL)
	{
		TRACE("get_network_config:no enough memory\n");
		return -1;
	}
	
	flash_bytes_read(NetConfig_Addr, netcfgbuf, MaxNetConfigLen);
	/*
	printf("netcfgbuf:");
	for (i = 0; i < MaxNetConfigLen; ++i)
		printf("%d ", netcfgbuf[i]);
	printf("\n");
	*/
	if (strncmp((char *)netcfgbuf, NetConfig_Marker, strlen(NetConfig_Marker)) != 0)
	{
		TRACE("use default network setting\n");
		memcpy(para->ip, DefIpAddr, 4);
		memcpy(para->subnetMask, DefSubnetMask, 4);
		memcpy(para->gatewayIP, DefGateWay, 4);
		memcpy(para->mac, DefMac, 6);
		para->listenPort = DefTcpPort;
		memcpy(para->dnsServer, DefDnsServer, 4);
	}
	else
	{
		pos = strlen(NetConfig_Marker);
		memcpy(para->ip, netcfgbuf+pos, 4);
		pos += 4;
		memcpy(para->subnetMask, netcfgbuf+pos, 4);
		pos += 4;
		memcpy(para->gatewayIP, netcfgbuf+pos, 4);
		pos += 4;
		memcpy(para->mac, netcfgbuf+pos, 6);
		pos += 6;
		para->listenPort = GetNumU16(netcfgbuf+pos);
		pos += 2;
		memcpy(para->dnsServer, netcfgbuf+pos, 4);
	}
	
	free_hexp(netcfgbuf);
	return 0;
}
void dump_network_config(networkParaConfig *para)
{
#ifdef _DEBUG
	TRACE("dump_network_config start\n");
	TRACE("ip:%d.%d.%d.%d\n", para->ip[0], para->ip[1], para->ip[2], para->ip[3]);
	TRACE("netmake:%d.%d.%d.%d\n", para->subnetMask[0], 
		para->subnetMask[1], para->subnetMask[2], para->subnetMask[3]);
	TRACE("gateway:%d.%d.%d.%d\n", para->gatewayIP[0], 
		para->gatewayIP[1], para->gatewayIP[2], para->gatewayIP[3]);
	TRACE("dns:%d.%d.%d.%d\n", para->dnsServer[0], 
		para->dnsServer[1], para->dnsServer[2], para->dnsServer[3]);
	TRACE("mac: %02X:%02X:%02X:%02X:%02X:%02X\n", para->mac[0], 
		para->mac[1], para->mac[2], para->mac[3], para->mac[4], para->mac[5]);
	TRACE("dump_network_config end\n");
#endif
}

int is_netconf_dhcp(networkParaConfig *para)
{
	 if (get_network_config(para) != 0)
	 {
		 TRACE("is_netconf_dhcp get_network_config error\n");
		 return -1;
	 }
	 if (para->ip[0] == 0 && para->ip[1] == 0 && 
		para->ip[2] == 0 && para->ip[3] == 0)
	 {
//		 memcpy(para->ip, DefIpAddr, 4);
//		 memcpy(para->subnetMask, DefSubnetMask, 4);
//		 memcpy(para->gatewayIP, DefGateWay, 4);
		return 1;
	 }
	 else
		return 0;
}


int getBtParams(BtParams_ST *params)
{	
	int pos = 0;
	int ftpuserlen;
	int ftppwdlen;
	int ftpseraddrlen;
	int fnamelen;
	int ret = 0;
	int paratotlen;
	int i;
	uint32 btcrc = 0;
	uint32 btcrcOnflh = 0;
	
	uint8 *bootcfgbuf = malloc_hexp(MaxBootConfigLen);
	
	if (bootcfgbuf == NULL)
	{
		TRACE("getBtParams:no enough memory\n");
		return -1;
	}
	flash_bytes_read(BootConfig_Addr, bootcfgbuf, MaxBootConfigLen);
	
	pos = strlen(BtParams_Marker);
	if (memcmp(bootcfgbuf, BtParams_Marker, pos) != 0)
	{
		TRACE("getBtParams: BtParams_Marker error\n");
		ret = -1;
		goto FIN;
	}
	
	paratotlen = GetNumU16(bootcfgbuf+pos);
	pos += 2;
	
	if (paratotlen + pos + 4 > MaxBootConfigLen)
	{
		TRACE("getBtParams: paratotlen error\n");
		ret = -1;
		goto FIN;
	}
	
	for (i = 0; i < paratotlen+strlen(BtParams_Marker)+2; ++i)
		btcrc += bootcfgbuf[i];
	
	btcrcOnflh = GetNumU32(bootcfgbuf+pos+paratotlen);
//	printf("0000 crc pos:%d, paratotlen:%d, btcrc:%08X, btcrcOnflh:%08X\n", 
//		pos+paratotlen, paratotlen, btcrc, btcrcOnflh);
	if (btcrcOnflh != btcrc)
	{
		TRACE("getBtParams: btcrc error\n");
		ret = -1;
		goto FIN;		
	}
	
	params->updateflag = bootcfgbuf[pos++];
	params->firmwareaddr = GetNumU32(bootcfgbuf+pos);
	pos += 4;
	params->firmwaresize = GetNumU32(bootcfgbuf+pos);
	pos += 4;
	params->firmwarecrc = GetNumU32(bootcfgbuf+pos);
	pos += 4;
	params->firmwarever = GetNumU32(bootcfgbuf+pos);
	pos += 4;
	params->updatemode = (FwUpdateModeCode)bootcfgbuf[pos++];
	
	ftpuserlen = bootcfgbuf[pos++];
	memcpy(params->ftpuser, bootcfgbuf+pos, ftpuserlen);
	params->ftpuser[ftpuserlen] = 0;
	pos += ftpuserlen;
	
	ftppwdlen = bootcfgbuf[pos++];
	memcpy(params->ftppassword, bootcfgbuf+pos, ftppwdlen);
	params->ftppassword[ftppwdlen] = 0;
	pos += ftppwdlen;
	
	ftpseraddrlen = bootcfgbuf[pos++];
	memcpy(params->ftpaddr, bootcfgbuf+pos, ftpseraddrlen);
	params->ftpaddr[ftpseraddrlen] = 0;
	pos += ftpseraddrlen;
	
	fnamelen = bootcfgbuf[pos++];
	memcpy(params->filename, bootcfgbuf+pos, fnamelen);
	params->filename[fnamelen] = 0;
	pos += fnamelen;
	
	params->btParamscrc = GetNumU32(bootcfgbuf+pos);
	pos += 4;
	
FIN:
	free_hexp(bootcfgbuf);
	return ret;
}

int setBtParams(BtParams_ST *params)
{
	int pos;
	int err = 0;
	int ftpuserlen;
	int ftppwdlen;
	int ftpseraddrlen;
	int fnamelen;
	ConfReadBuffer confBuf;
	int i;
	uint32 btcrc = 0;
	
	E(pre_set_config(&confBuf));

	
	strcpy((char *)confBuf.bootcfgbuf, BtParams_Marker);
	pos = strlen(BtParams_Marker)+2;
	
	confBuf.bootcfgbuf[pos++] = params->updateflag;
	SetNumU32(confBuf.bootcfgbuf+pos, params->firmwareaddr);
	pos += 4;
	SetNumU32(confBuf.bootcfgbuf+pos, params->firmwaresize);
	pos += 4;
	SetNumU32(confBuf.bootcfgbuf+pos, params->firmwarecrc);
	pos += 4;
	SetNumU32(confBuf.bootcfgbuf+pos, params->firmwarever);
	pos += 4;	
	confBuf.bootcfgbuf[pos++] = params->updatemode;

	ftpuserlen = strlen(params->ftpuser);
	confBuf.bootcfgbuf[pos++] = ftpuserlen;
	memcpy(confBuf.bootcfgbuf+pos, params->ftpuser, ftpuserlen);
	pos += ftpuserlen;
	
	ftppwdlen = strlen(params->ftppassword);
	confBuf.bootcfgbuf[pos++] = ftppwdlen;
	memcpy(confBuf.bootcfgbuf+pos, params->ftppassword, ftppwdlen);
	pos += ftppwdlen;
	
	ftpseraddrlen = strlen(params->ftpaddr);
	confBuf.bootcfgbuf[pos++] = ftpseraddrlen;	
	memcpy(confBuf.bootcfgbuf+pos, params->ftpaddr, ftpseraddrlen);
	pos += ftpseraddrlen;
	
	fnamelen = strlen(params->filename);
	confBuf.bootcfgbuf[pos++] = fnamelen;	
	memcpy(confBuf.bootcfgbuf+pos, params->filename, fnamelen);
	pos += fnamelen;
	
	SetNumU16(confBuf.bootcfgbuf+strlen(BtParams_Marker), 
		pos-strlen(BtParams_Marker)-2);
		
	for (i = 0; i < pos; ++i)
		btcrc += confBuf.bootcfgbuf[i];
	
//	printf("1111 crc pos:%d, paramlen:%d, btcrc:%08X\n", pos, pos-strlen(BtParams_Marker)-2, btcrc);
	SetNumU32(confBuf.bootcfgbuf+pos, btcrc);
//	pos += 4;
		
	E(set_config_to_flash(&confBuf));
	E(getBtParams(params));
FIN:
	return err;	
}

void firmware_upgrade(uint8 flag)
{
	BtParams_ST btparams;
	getBtParams(&btparams);
	btparams.updateflag = flag;
	setBtParams(&btparams);
	sleep_ms(100);
	system_reset();
}

void erase_active_mode_params(void)
{
	erase_multi_config(ERASE_FLS_CFG_BIT_ACTMODE);
}

