deeprfid/Scanner_Decoder/hc32f46_driver/trunk/user/src/readercfg.c
void dumpBtParams(BtParams_ST *params)
{
	TRACE("BtParams dump start\n");
	TRACE("updateflag : %d\n", params->updateflag);
	TRACE("firmwareaddr : %d\n", params->firmwareaddr);
	TRACE("firmwaresize : %d\n", params->firmwaresize);
	TRACE("firmwarecrc : %08X\n", params->firmwarecrc);
	TRACE("firmwarever : %d\n", params->firmwarever);
	
	TRACE("updatemode : %d\n", params->updatemode);
	TRACE("ftpuser : %s\n", params->ftpuser);
	TRACE("ftppassword : %s\n", params->ftppassword);
	TRACE("ftpaddr : %s\n", params->ftpaddr);
	TRACE("filename : %s\n", params->filename);
	
	TRACE("btParamscrc : %d\n", params->btParamscrc);
	TRACE("BtParams dump end\n");
}

void firmware_version(uint8 *version)
{
	BtParams_ST btparam;
	int ver = 0;
	if(version)
	{
		if(getBtParams(&btparam) == 0)
			ver = btparam.firmwarever;
		version[0] = (ver >> 24) & 0xff;
		version[1] = (ver >> 16) & 0xff;
		version[2] = (ver >> 8) & 0xff;
		version[3] = (ver >> 0) & 0xff;
	}
}

int erase_multi_config(uint16 erasebits)
{
	int err = 0;
	ConfReadBuffer confBuf;
	uint8 zerobytes[30] = {0x00};
	
	if (erasebits == 0)
		return 0;
	
	E(pre_set_config(&confBuf));
	if ((erasebits & ERASE_FLS_CFG_BIT_ETHERNET) == ERASE_FLS_CFG_BIT_ETHERNET)
	{
		int pos = 0;
		memcpy(confBuf.netcfgbuf+pos, NetConfig_Marker, strlen(NetConfig_Marker));
		pos += strlen(NetConfig_Marker);
		memcpy(confBuf.netcfgbuf+pos, DefIpAddr, 4);
		pos += 4;
		memcpy(confBuf.netcfgbuf+pos, DefSubnetMask, 4);
		pos += 4;
		memcpy(confBuf.netcfgbuf+pos, DefGateWay, 4);
		pos += 4;
		memcpy(confBuf.netcfgbuf+pos, gNetConf.mac, 6);			
		pos += 6;
		SetNumU16((uint8*)confBuf.netcfgbuf+pos, DefTcpPort);
		pos += 2;
		memcpy(confBuf.netcfgbuf+pos, DefDnsServer, 4);
	}
	
	if ((erasebits & ERASE_FLS_CFG_BIT_WLAN) == ERASE_FLS_CFG_BIT_WLAN)
		memcpy(confBuf.wificfgbuf, zerobytes, sizeof(zerobytes));
	
	if ((erasebits & ERASE_FLS_CFG_BIT_HWTYPE) == ERASE_FLS_CFG_BIT_HWTYPE)
		memcpy(confBuf.hwtypecfgbuf, zerobytes, sizeof(zerobytes));

	if ((erasebits & ERASE_FLS_CFG_BIT_BLUETOOTH) == ERASE_FLS_CFG_BIT_BLUETOOTH)
		memcpy(confBuf.bluetoothcfgbuf, zerobytes, sizeof(zerobytes));
	
	if ((erasebits & ERASE_FLS_CFG_BIT_ACTMODE) == ERASE_FLS_CFG_BIT_ACTMODE)
		memcpy(confBuf.activemodecfgbuf, zerobytes, sizeof(zerobytes));
		
	if ((erasebits & ERASE_FLS_CFG_BIT_WKMODEPARA) == ERASE_FLS_CFG_BIT_WKMODEPARA)
		memcpy(confBuf.workmodeparambuf, zerobytes, sizeof(zerobytes));
	
	if ((erasebits & ERASE_FLS_CFG_BIT_PSVMODE) == ERASE_FLS_CFG_BIT_PSVMODE)
	{
		TRACE("if ((erasebits & ERASE_FLS_CFG_BIT_PSVMODE) == ERASE_FLS_CFG_BIT_PSVMODE)\n");
		memcpy(confBuf.passivemodecfgbuf, zerobytes, sizeof(zerobytes));
	}
	
	E(set_config_to_flash(&confBuf));
	
FIN:
	return err;
}

int erase_wlan_config(void)
{
	int err = 0;
	ConfReadBuffer confBuf;
	E(pre_set_config(&confBuf));
	memset(confBuf.wificfgbuf, 0, 32);
	E(set_config_to_flash(&confBuf));
FIN:
	return err;
	
}

BoardComponents_ST gBoardCompos;
Spi_Ex_Code get_spi_ex_dev(void)
{
	return (Spi_Ex_Code)gBoardCompos.spi_ex;
}

int get_board_compos(void)
{
	int pos = strlen(HwTypeConfig_Marker);
	uint8 *buf = malloc_hexp(MaxHwTypeConfigLen);
	
	if (buf == NULL)
	{
		TRACE("get_board_compos:no enough memory\n");
		return -1;
	}
	
	flash_bytes_read(HwTypeConfig_Addr, buf, MaxHwTypeConfigLen);
	if (memcmp(HwTypeConfig_Marker, buf, pos) == 0)
	{
		gBoardCompos.spi_ex = buf[pos++];
		gBoardCompos.uart_ex = buf[pos++];
		free_hexp(buf);
	}
	else
	{
		gBoardCompos.spi_ex = Spi_Ex_None;
		gBoardCompos.uart_ex = Uart_Ex_None;
		free_hexp(buf);
		return -1;
	}
	/*
	gBoardCompos.spi_ex = Spi_Ex_Ethernet;
//	gBoardCompos.uart1_ex = Uart1_Ex_Bluetooth;
	gBoardCompos.uart1_ex = Uart1_Ex_None;
//	gBoardCompos.uart1_ex = Uart1_Ex_Wlan;
	*/
	return 0;
}

Uart_Ex_Code get_uart_ex_dev(void)
{
	return (Uart_Ex_Code)gBoardCompos.uart_ex;
}

void dump_wlan_config(WlanConfig_ST *wlanst)
{
#ifdef _DEBUG
	TRACE("dump_wlan_config start\n");
	dump_network_config(&wlanst->ipinfo);
	TRACE("ssid:%s\n", wlanst->ssid);
	TRACE("mode:%d\n", wlanst->mode);
//	printf("encry:%d\n", wlanst->encry);
	TRACE("pwd:%s\n", wlanst->pwd);
	TRACE("dump_wlan_config end\n");
#endif
}

int get_wlan_config(WlanConfig_ST *wlanst)
{
	int pos = strlen(WifiConfig_Marker);
	char *buf = malloc_hexp(MaxWifiConfigLen);
	
	if (buf == NULL)
	{
		TRACE("get_wlan_config:no enough memory\n");
		return -1;
	}
	
	setdef_wlan_config(wlanst);
	
	flash_bytes_read(WifiConfig_Addr, buf, MaxWifiConfigLen);
	if (memcmp(WifiConfig_Marker, buf, pos) == 0)
	{
		int jsonlen = GetNumU16((uint8 *)buf+pos);
		int vlret;
		pos += 2;
		vlret = valid_wlan_config(buf+pos, jsonlen, wlanst);
		memcpy(wlanst->ipinfo.mac, gWlanNet.mac, 6);
		TRACE("get_wlan_config valid_wlan_config vlret:%d\n", vlret);
		free_hexp(buf);
		if (vlret != 0)
			setdef_wlan_config(wlanst);
		return vlret;
	}
	else
	{
		setdef_wlan_config(wlanst);
		memcpy(wlanst->ipinfo.mac, gWlanNet.mac, 6);
		TRACE("not find WifiConfig_Marker\n");
		free_hexp(buf);
		return -1;
	}
}

const uint8 DefAPAddr[] = {10, 0, 0, 1};
const uint8 DefAPSubnetMask[] = {255, 255, 255, 0};
const uint8 DefAPGateWay[] = {0, 0, 0, 0};
const uint8 DefAPDns[] = {0, 0, 0, 0};
#define DefAPSSID "UHF-Reader"

void setdef_wlan_config(WlanConfig_ST *wlanst)
{
	memcpy(wlanst->ipinfo.ip, DefAPAddr, 4);
	memcpy(wlanst->ipinfo.subnetMask, DefAPSubnetMask, 4);
	memcpy(wlanst->ipinfo.gatewayIP, DefAPGateWay, 4);
	memcpy(wlanst->ipinfo.dnsServer, DefAPDns, 4);
	wlanst->ipinfo.listenPort = DefTcpPort;
	wlanst->mode = Wlan_WMode_AP;
	strcpy(wlanst->ssid, DefAPSSID);
	wlanst->pwd[0] = 0;
}

#if IS_RTOS2_SUPPORT
#define PARSE_CHK_IN_TAB(elm, name, item, tab, exist) \
	do { \
		if (json_getint(elm, name, &pvalint) == 0) \
		{ \
			if (is_in_inttab(tab, sizeof(tab)/4, pvalint) == 0) \
			{ \
				TRACE("%s is invalid\n", #name); \
				return -1;	\
			} \
			else \
				item = pvalint; \
		} \
		else \
		{ \
			if (exist == 1) \
			{ \
				TRACE("%s dose not find\n", #name); \
				return -1; \
			} \
		} \
	} while (0)
	

