deeprfid/Scanner_Decoder/hc32f46_driver/trunk/user/src/readercfg.c
#define PARSE_CHK_RANGE(obj, name, item, min, max, exist) \
	do { \
		exflag = 0; \
		if (json_getint(obj, name, &pvalint) == 0) \
		{ \
			if (pvalint < min || pvalint > max) \
			{ \
				TRACE("%s is invalid\n", #name); \
				return -1;	\
			} \
			else \
			{ \
				exflag = 1; \
				item = pvalint; \
			} \
		} \
		else \
		{ \
			if (exist == 1) \
			{ \
				TRACE("%s dose not find\n", #name); \
				return -1; \
			} \
		} \
	} while (0)
	
#define PARSE_CHK_STR(obj, name, item, len, exist, canempty) \
	do { \
		exflag = 0; \
		if (json_getstring_len(obj, name, len, 2, item) != 0) \
		{ \
			if (exist == 1) \
			{ \
				TRACE("%s dose not find\n", #name); \
				return -1; \
			} \
		} \
		else \
		{ \
			if (item[0] == 0 && canempty == 0) \
			{ \
				TRACE("%s len is invalid\n", #name); \
				return -1; \
			} \
			exflag = 1; \
		} \
	} while (0)

int is_in_inttab(int *tab, int len, int val)
{
	int i;
	for (i = 0; i < len; ++i)
	{
		if (val == tab[i])
			return 1;
	}
	return 0;
}

int valid_ipinfo_cfg(json_value *obj, networkParaConfig *ipinfo)
{
	char strbuf[30];
	int pvalint;
	int exflag;
	
	PARSE_CHK_STR(obj, "ip", strbuf, 29, 1, 0);
	if (addr_str2bin(strbuf, ipinfo->ip) != 0)
	{
		TRACE("ip format error\n");
		return -1;
	}

	PARSE_CHK_STR(obj, "nm", strbuf, 29, 1, 0);
	if (addr_str2bin(strbuf, ipinfo->subnetMask) != 0)
	{
		TRACE("nm format error\n");
		return -1;
	}

	PARSE_CHK_STR(obj, "gw", strbuf, 29, 1, 0);
	if (addr_str2bin(strbuf, ipinfo->gatewayIP) != 0)
	{
		TRACE("gw format error\n");
		return -1;
	}

	PARSE_CHK_STR(obj, "dns", strbuf, 29, 0, 0);
	if (exflag)
	{
		if (addr_str2bin(strbuf, ipinfo->dnsServer) != 0)
		{
			TRACE("dns format error\n");
			return -1;
		}
	}
		
	PARSE_CHK_STR(obj, "mac", strbuf, 29, 0, 0);
	if (exflag)
	{
		if (strlen(strbuf) != 12)
		{
			TRACE("mac len must be 12\n");
			return -1;				
		}
		uint8 machex[6];
		if (strTohex(strbuf, 12, machex) != 0)
		{
			TRACE("mac format error\n");
			return -1;	
		}
			
		if (!(machex[0] == 0xff && machex[1] == 0xff && 
			machex[2] == 0xff && machex[3] == 0xff && 
			machex[4] == 0xff && machex[5] == 0xff ))
			memcpy(ipinfo->mac, machex, 6);
	}
	
	PARSE_CHK_RANGE(obj, "lport", ipinfo->listenPort, 100, 65530, 0);
	return 0;
}

int valid_wlan_config_byobj(json_value *jvalue, WlanConfig_ST *wlanst)
{
	int pvalint;
	int exflag;
	
	if (valid_ipinfo_cfg(jvalue, &wlanst->ipinfo) != 0)
	{
		TRACE("ipinfo is invalid\n");
		return -1;		
	}
	
	PARSE_CHK_RANGE(jvalue, "mode", wlanst->mode, 1, 2, 1);
	if (wlanst->mode == Wlan_WMode_AP)
	{
		if (wlanst->ipinfo.ip[0] == 0 && wlanst->ipinfo.ip[1] == 0 && 
			wlanst->ipinfo.ip[2] == 0 && wlanst->ipinfo.ip[3] == 0)
		{
			TRACE("dhcp dose not allow with ap mode\n");
			return -1;			
		}
	}
	
	PARSE_CHK_STR(jvalue, "ssid", wlanst->ssid, 32, 1, 0);
	/*
	PARSE_CHK_RANGE(jvalue, "auth", wlanst->auth, 0, 3, 1);
	
	PARSE_CHK_RANGE(jvalue, "encry", wlanst->encry, 0, 4, 1);
	if (wlanst->encry == Wlan_Encry_NONE)
	{
		if (wlanst->auth != Wlan_Auth_OPEN)
		{
			TRACE("auth should be Wlan_Auth_OPEN\n");
			return -1;
		}
	}
	else if (wlanst->encry == Wlan_Encry_TKIP || 
		wlanst->encry == Wlan_Encry_AES)
	{
		if (!(wlanst->auth == Wlan_Auth_WPAPSK || 
			wlanst->auth == Wlan_Auth_WPA2PSK))
		{
			TRACE("auth should be Wlan_Auth_WPAPSK or Wlan_Auth_WPA2PSK\n");
			return -1;
		}
	}
	else if (wlanst->encry == Wlan_Encry_WEP_A || 
		wlanst->encry == Wlan_Encry_WEP_H)
	{
		if (wlanst->auth != Wlan_Auth_SHARED)
		{
			TRACE("auth should be Wlan_Auth_SHARED\n");
			return -1;
		}
	}
	*/
	PARSE_CHK_STR(jvalue, "pwd", wlanst->pwd, 64, 0, 1);
	if (!exflag)
		wlanst->pwd[0] = 0;
	/*
	keylen = strlen(wlanst->key);
	if (keylen == 0)
	{
		if (wlanst->auth != Wlan_Auth_OPEN)
		{
			TRACE("key is none, auth is not Wlan_Auth_OPEN\n");
			return -1;
		}
	}
	else
	{
		if (wlanst->auth == Wlan_Auth_WPAPSK || 
				wlanst->auth == Wlan_Auth_WPA2PSK)
		{
			if (keylen < 8)
			{
				TRACE("key len is invalid, less than 8\n");
				return -1;	
			}
		}
		else
		{
			if (wlanst->encry == Wlan_Encry_WEP_A)
			{
				if (!(keylen == 5 || keylen == 13))
				{
					TRACE("key len is invalid, should be 5 or 13\n");
					return -1;	
				}
			}
			else if (wlanst->encry == Wlan_Encry_WEP_H)
			{
				if (keylen == 10 || keylen == 26)
				{
					int i;
					for (i = 0; i < keylen; ++i)
					{
						if (!((wlanst->key[i] >= '0' &&  wlanst->key[i] <= '9') || 
							(wlanst->key[i] >= 'A' &&  wlanst->key[i] <= 'F')))
						{
							TRACE("key should be hex string\n");
							return -1;							
						}
					}
				}
				else
				{
					TRACE("key len is invalid, should be 10 or 26\n");
					return -1;	
				}
			}
		}
	}*/
	return 0;
}
#endif

int get_json_field(char *buf, char *field, int type, char *strbuf)
{
	char *tmp1,*tmp2;
	char field_[50];
	
	sprintf(field_, "\"%s\":", field);
	tmp1 = strstr(buf, field_);
	if (tmp1 == NULL)
		return -1;

	if (type == 1)
	{
		tmp2 = strstr(tmp1+strlen(field_)+1, "\"");
		if (tmp1 == NULL)
			return -1;

		memcpy(strbuf, tmp1+strlen(field_)+1, tmp2-(tmp1+strlen(field_)+1));
		strbuf[tmp2-(tmp1+strlen(field_)+1)] = 0;
	}
	else if (type == 2)
	{
		tmp2 = strstr(tmp1+strlen(field_), ",");
		if (tmp1 == NULL)
			return -1;

		memcpy(strbuf, tmp1+strlen(field_), tmp2-(tmp1+strlen(field_)));
		strbuf[tmp2-(tmp1+strlen(field_))] = 0;
	}
	else
		return -1;

	return 0;
}

int valid_wlan_config(char *buf, int blen, WlanConfig_ST *wlanst)
{
#if IS_RTOS2_SUPPORT
	json_value *jvalue;

	jvalue = json_parse(buf, blen);
	if (jvalue == NULL)
	{
		TRACE("valid_wlan_config jvalue == NULL\n");
		return -1;
	}
	return valid_wlan_config_byobj(jvalue, wlanst);
#else
	char strbuf[100];
	
	buf[blen] = 0;
//	TRACE("valid_wlan_config:%s\n", buf);
	if (get_json_field(buf, "ip", 1, strbuf) == 0)
	{
		if (addr_str2bin(strbuf, wlanst->ipinfo.ip) != 0)
		{
			TRACE("ip format error\n");
			return -1;
		}
	}
	else
		return -1;

	if (get_json_field(buf, "nm", 1, strbuf) == 0)
	{
		if (addr_str2bin(strbuf, wlanst->ipinfo.subnetMask) != 0)
		{
			TRACE("nm format error\n");
			return -1;
		}	
	}
	else
		return -1;
	
	if (get_json_field(buf, "gw", 1, strbuf) == 0)
	{
		if (addr_str2bin(strbuf, wlanst->ipinfo.gatewayIP) != 0)
		{
			TRACE("gw format error\n");
			return -1;
		}	
	}
	else
		return -1;
	
	if (get_json_field(buf, "dns", 1, strbuf) == 0)
	{
		if (addr_str2bin(strbuf, wlanst->ipinfo.dnsServer) != 0)
		{
			TRACE("dns format error\n");
			return -1;
		}	
	}
	else
		return -1;

	if (get_json_field(buf, "lport", 2, strbuf) == 0)
		wlanst->ipinfo.listenPort = atoi_Arm(strbuf);
	else
		return -1;
	
	if (get_json_field(buf, "mode", 2, strbuf) == 0)
		wlanst->mode = atoi_Arm(strbuf);
	else
		return -1;
	if (wlanst->mode == Wlan_WMode_AP)
	{
		if (wlanst->ipinfo.ip[0] == 0 && wlanst->ipinfo.ip[1] == 0 && 
			wlanst->ipinfo.ip[2] == 0 && wlanst->ipinfo.ip[3] == 0)
		{
			TRACE("dhcp dose not allow with ap mode\n");
			return -1;			
		}
	}

	if (get_json_field(buf, "ssid", 1, wlanst->ssid) != 0)
		return -1;
	
	if (get_json_field(buf, "pwd", 1, wlanst->pwd) != 0)
		wlanst->pwd[0] = 0;
	
