deeprfid/Scanner_Decoder/hc32f46_driver/trunk/user/src/readercfg.c
	pACP->data_aggr_mode = pConf[pos++];
	if (pACP->data_aggr_mode == 1)
	{
		pACP->data_aggr_duration = GetNumU32(pConf+pos);
		pos += 4;
	}
	
	pACP->is_gpi_trigger = pConf[pos++];
	if (pACP->is_gpi_trigger == 1)
	{
		pACP->gpi_trigger_mode = pConf[pos++];
		
		pACP->gpi_trigger1.gpi_count = pConf[pos++];
		for (i = 0; i < pACP->gpi_trigger1.gpi_count; ++i)
		{
			pACP->gpi_trigger1.gpi_ids[i] = pConf[pos++];
			pACP->gpi_trigger1.gpi_states[i] = pConf[pos++];
		}
		
		if (pACP->gpi_trigger_mode == 1 || pACP->gpi_trigger_mode == 3
			|| pACP->gpi_trigger_mode == 4)
		{
			pACP->gpi_trigger2.gpi_count = pConf[pos++];
			for (i = 0; i < pACP->gpi_trigger2.gpi_count; ++i)
			{
				pACP->gpi_trigger2.gpi_ids[i] = pConf[pos++];
				pACP->gpi_trigger2.gpi_states[i] = pConf[pos++];
			}
		}
		
		pACP->gpi_read_timeout = GetNumU32(pConf+pos);
		pos += 4;			

	}

	pACP->gpo_init_states = pConf[pos++];
	pACP->loc_gpo_act_count = pConf[pos++];
	for (i = 0; i < pACP->loc_gpo_act_count; ++i)
	{
		pACP->lga_gpo_id[i] = pConf[pos++];
		pACP->lga_gpo_states[i] = pConf[pos++];
		pACP->lga_gpo_durs[i] = GetNumU32(pConf+pos);
		pos += 4;
	}
	
	pACP->event_count = pConf[pos++];
	for (i = 0; i < pACP->event_count; ++i)
		pACP->events[i] = pConf[pos++];
	
	pACP->inv_cycle = GetNumU16(pConf+pos);
	pos += 2;
	
	pACP->interval_cycle = GetNumU16(pConf+pos);
	pos += 2;
	pACP->max_rec_databytes_length = pConf[pos++];
	pACP->cusparam_len = pConf[pos++];
	memcpy(pACP->cusparam, pConf+pos, pACP->cusparam_len);
	pACP->cusparam[pACP->cusparam_len] = 0;
	
	free_hexp(actcfgbuf);
	return 0;
}
int TestFwType(void)
{
//	int i;
	unsigned char tmpbuffer[20];
	flash_bytes_read(ActiveModeConfig_Addr, tmpbuffer, 20);
/*	
	TRACE("TestFwType:");
	for (i = 0; i < 20; ++i)
		TRACE("%02X ", tmpbuffer[i]);
	TRACE("\n");
	*/
	if (memcmp(tmpbuffer, ACPMagicStr, 15) == 0)
		return 1;
	else
		return 0;
}

WorkMode_Code TestFwType_ex(void)
{
//	int i;
	WorkMode_Code wmc;
	unsigned char tmpbuffer[20];
	flash_bytes_read(ActiveModeConfig_Addr, tmpbuffer, 20);
	get_workmode_params(&wmc);
	TRACE("TestFwType_ex wmc:%d\n", wmc);
/*	
	TRACE("TestFwType:");
	for (i = 0; i < 20; ++i)
		TRACE("%02X ", tmpbuffer[i]);
	TRACE("\n");
	*/
	if (memcmp(tmpbuffer, ACPMagicStr, 15) == 0)
		return WorkMode_ActVer_1;
	else if (memcmp(tmpbuffer, ActModeCfg_Marker, 15) == 0 && 
		wmc == WorkMode_ActVer_2)
		return WorkMode_ActVer_2;
	else
		return WorkMode_Passive;
}

void dump_active_mode_config(AppCustomParams *pACP)
{
#ifdef _DEBUG
	int i;
	TRACE("DumpAppCustomParams start--------------------\n");
	TRACE("name:%s\n", pACP->name);
	
	TRACE("rpwrs_len:%d\n", pACP->rpwrs_len);
	for (i = 0; i < pACP->rpwrs_len; ++i)
		TRACE("%d, rpwr:%d\n", i+1, pACP->rpwrs[i]);
	TRACE("region:%d\n", pACP->region);
	TRACE("hoptable cnt:%d\n", pACP->hoptab_len);
	for (i = 0; i < pACP->hoptab_len; ++i)
		TRACE("%d ", pACP->frepoints[i]);
	
	TRACE("\ngen2session:%d\n", pACP->gen2session);
	TRACE("gen2q:%d\n", pACP->gen2q);
	TRACE("is_tagdata_uni_byant:%d\n", pACP->is_tagdata_uni_byant);
	TRACE("is_tagdata_uni_bybank:%d\n", pACP->is_tagdata_uni_bybank);
	TRACE("is_record_max_rssi:%d\n", pACP->is_record_max_rssi);
	
	TRACE("invants cnt:%d\n", pACP->invants_len);
	for (i = 0; i < pACP->invants_len; ++i)
		TRACE("%d ", pACP->inv_ants[i]);
	
	TRACE("\nheart_beat_cylce:%d\n", pACP->heart_beat_cylce);
	
	TRACE("\nis_tagfilter:%d\n", pACP->is_tagfilter);
	if (pACP->is_tagfilter == 1)
	{
		TRACE("bank:%d, start_bit:%d, is_match:%d, mask_len:%d, mask:", pACP->tag_filter.bank, 
			pACP->tag_filter.start_bit, pACP->tag_filter.is_match, pACP->tag_filter.mask_len);
		{
			int maskbytecnt = (pACP->tag_filter.mask_len % 8 == 0) ? (pACP->tag_filter.mask_len / 8) : 
				((pACP->tag_filter.mask_len / 8) + 1); 
			for (i = 0; i < maskbytecnt; ++i)
				TRACE("%02X ", pACP->tag_filter.mask[i]);
		}
	}
	TRACE("\nis_inv_bank_read:%d\n", pACP->is_inv_bank_read);
	if (pACP->is_inv_bank_read == 1)
	{
		TRACE("bank:%d, start_block:%d, blockcnt:%d, pwd:%08X\n", 
			pACP->inv_bank_read.bank, pACP->inv_bank_read.start_block, pACP->inv_bank_read.blockcnt,
			GetNumU32(pACP->inv_bank_read.pwd));
	}
	
	TRACE("upload_ip:%d.%d.%d.%d\n", pACP->upload_ip[0], pACP->upload_ip[1], 
		pACP->upload_ip[2], pACP->upload_ip[3]);

	TRACE("upload_port:%d\n", pACP->upload_port);
	TRACE("conn_mode:%d\n", pACP->conn_mode);
	TRACE("ack_client_mode:%d\n", pACP->ack_client_mode);
	
	TRACE("data_aggr_mode:%d\n", pACP->data_aggr_mode);
	if (pACP->data_aggr_mode == 1)
		TRACE("data_aggr_duration:%d\n", pACP->data_aggr_duration);
	
	TRACE("is_gpi_trigger:%d\n", pACP->is_gpi_trigger);
	if (pACP->is_gpi_trigger == 1)
	{
		TRACE("gpi_trigger_mode:%d\n", pACP->gpi_trigger_mode);
		TRACE("gpi_trigger1:\n");
		for (i = 0; i < pACP->gpi_trigger1.gpi_count; ++i)
			TRACE("    gpi_id:%d, gpi_state:%d\n",pACP->gpi_trigger1.gpi_ids[i], pACP->gpi_trigger1.gpi_states[i]);
		
		if (pACP->gpi_trigger_mode == 1 || pACP->gpi_trigger_mode == 3 || 
			pACP->gpi_trigger_mode == 4)
		{
			TRACE("gpi_trigger2:\n");
			for (i = 0; i < pACP->gpi_trigger2.gpi_count; ++i)
				TRACE("    gpi_id:%d, gpi_state:%d\n",pACP->gpi_trigger2.gpi_ids[i], pACP->gpi_trigger2.gpi_states[i]);
		}
		TRACE("gpi_read_timeout:%d\n", pACP->gpi_read_timeout);		
	}
	
	TRACE("gpo init state:%02X\n", pACP->gpo_init_states);
	TRACE("local gpo action count:%d\n", pACP->loc_gpo_act_count);
	for (i = 0; i < pACP->loc_gpo_act_count; ++i)
	{
		TRACE("gpo%d state:%d dur:%d", pACP->lga_gpo_id[i], 
			pACP->lga_gpo_states[i], pACP->lga_gpo_durs[i]);
		TRACE("--");
	}
	TRACE("\n");
	
	TRACE("event_count:%d\n", pACP->event_count);
	for (i = 0; i < pACP->event_count; ++i)
		printf("%d ", pACP->events[i]);
	
	TRACE("\ninv_cycle:%d\n", pACP->inv_cycle);
	TRACE("interval_cycle:%d\n", pACP->interval_cycle);
	TRACE("max_rec_databytes_length:%d\n", pACP->max_rec_databytes_length);
	TRACE("cusparam:%s", pACP->cusparam);

	TRACE("\nDumpAppCustomParams end----------------------\n");
#endif
}

void setdef_active_mode_config(AppCustomParams *pACP)
{
	memset(pACP, 0, sizeof(AppCustomParams));
	strcpy((char*)pACP->name, "arm7Reader");
	pACP->name_len = strlen("arm7Reader");
	pACP->data_aggr_duration = 2000;
	pACP->gen2q = 255;
	pACP->heart_beat_cylce = 10;
	pACP->interval_cycle = 10;
	pACP->inv_cycle = 150;
	pACP->region = 1;
	pACP->max_rec_databytes_length = 32;
	pACP->upload_ip[0] = 169;
	pACP->upload_ip[1] = 169;
	pACP->upload_ip[2] = 169;
	pACP->upload_ip[3] = 169;
	pACP->upload_port = 12345;
	pACP->loc_gpo_act_count = 0;
	pACP->gpo_init_states = 0x0F;
}

