deeprfid/Scanner_Decoder/hc32f46_driver/trunk/user/src/readercfg.c
void AppCustomParams_To_static_settings(AppCustomParams *pAppCusPara, 
	ReaderStaticSettings_ST *static_set)
{
	int i;
	static_set->protocol.gen2.session = pAppCusPara->gen2session;
	static_set->rf.region = pAppCusPara->region;
	static_set->app_init.max_tb_rec_len = pAppCusPara->max_rec_databytes_length;
	
	static_set->tagops_param.inventory.ants_cnt = pAppCusPara->invants_len;
	for (i = 0; i < pAppCusPara->invants_len; ++i)
		static_set->tagops_param.inventory.ants[i] = pAppCusPara->inv_ants[i];

	static_set->tagops_param.inventory.cycle = pAppCusPara->inv_cycle;
	static_set->tagops_param.inventory.interval = pAppCusPara->interval_cycle;
	static_set->tagops_param.inventory.inv_mode = -1;
	
	static_set->tagops_param.tagfilter.is_tagfilter = pAppCusPara->is_tagfilter;
	if (pAppCusPara->is_tagfilter == 1)
	{
		static_set->tagops_param.tagfilter.bank = pAppCusPara->tag_filter.bank;
		static_set->tagops_param.tagfilter.mask_len = pAppCusPara->tag_filter.mask_len;
		static_set->tagops_param.tagfilter.match = pAppCusPara->tag_filter.is_match;
		memcpy(static_set->tagops_param.tagfilter.mask, pAppCusPara->tag_filter.mask, 64);
		static_set->tagops_param.tagfilter.start = pAppCusPara->tag_filter.start_bit;
	}
	
	static_set->tagops_param.bankdata.is_bankdata = pAppCusPara->is_inv_bank_read;
	if ( pAppCusPara->is_inv_bank_read == 1)
	{
		static_set->tagops_param.bankdata.bank = pAppCusPara->inv_bank_read.bank;
		static_set->tagops_param.bankdata.blkcnt = pAppCusPara->inv_bank_read.blockcnt;
		static_set->tagops_param.bankdata.start = pAppCusPara->inv_bank_read.start_block;
		memcpy(static_set->tagops_param.accessop.aespwd, pAppCusPara->inv_bank_read.pwd, 4);
	}
	else
		SetNumU32(static_set->tagops_param.accessop.aespwd, 0);
	
	if (pAppCusPara->rpwrs_len == 0)
	{
		for (i = 0; i < pAppCusPara->rpwrs_len; ++i)
		{
			static_set->rf.tx_powers[i].read_power = -1;
			static_set->rf.tx_powers[i].write_power = -1;
		}
	}
	else
	{
		if (pAppCusPara->rpwrs_len == 1)
		{
			for (i = 0; i < 16; ++i)
			{
				static_set->rf.tx_powers[i].read_power = pAppCusPara->rpwrs[0];
				static_set->rf.tx_powers[i].write_power = pAppCusPara->rpwrs[0];				
			}
		}
		else
		{
			for (i = 0; i < pAppCusPara->rpwrs_len; ++i)
			{
				static_set->rf.tx_powers[i].read_power = pAppCusPara->rpwrs[i];
				static_set->rf.tx_powers[i].write_power = pAppCusPara->rpwrs[i];
			}
		}
	}
	
	static_set->tag_data.unique_by_antenna = pAppCusPara->is_tagdata_uni_byant;
	static_set->tag_data.unique_by_bank_data = pAppCusPara->is_tagdata_uni_bybank;
	static_set->tag_data.record_highest_rssi = pAppCusPara->is_record_max_rssi;
	
	if (pAppCusPara->gpo_init_states > 0)
		static_set->gpos[i] = ((pAppCusPara->gpo_init_states >> i) & 0x1) + 1;
	
	if (pAppCusPara->upload_ip[0] == 0)
	{
		static_set->uart1.baud = (pAppCusPara->upload_ip[1] << 16) | 
			(pAppCusPara->upload_ip[2] << 8) | pAppCusPara->upload_ip[3];
		static_set->uart1.data_bits = 0;
		static_set->uart1.stop_bits = 0;
		static_set->uart1.parity = 0;
		static_set->uart1.flow_ctrl = 0;
		static_set->uart1.type = 0;
	}
}


void setdef_rdr_static_settings(ReaderStaticSettings_ST *static_set)
{
	int i;
	
	static_set->is_ethernet = 0;
	static_set->uart_ex_type = 0;
	
	static_set->app_init.usb_type = rdr_st_set_usb_type_HidCdc;
	static_set->app_init.max_tb_rec_len = MaxTbItemSize;
	static_set->app_init.evt_que_len = DefEvtQueSize;
	static_set->reboot = 1;
	
	static_set->tagops_param.inventory.ants_cnt = 0;
	static_set->tagops_param.inventory.cycle = 150;
	static_set->tagops_param.inventory.interval = 10;
	static_set->tagops_param.inventory.inv_mode = 0;
	static_set->tagops_param.tagfilter.is_tagfilter = 0;
	static_set->tagops_param.bankdata.is_bankdata = 0;
	static_set->tagops_param.accessop.ant = 0;
	static_set->tagops_param.accessop.timeout = 1000;
	SetNumU32(static_set->tagops_param.accessop.aespwd, 0);
	
	static_set->tagops_param.mb_sinv_tag_fmt = 0x01;
	
	static_set->protocol.gen2.session = -1;
	static_set->protocol.gen2.q = -2;
	static_set->protocol.gen2.target = -1;
	static_set->protocol.gen2.profile = -1;
	static_set->rf.ant_max_dwell_time = 0;
	static_set->rf.hop_mode = -1;
	static_set->rf.region = -1;
	static_set->rf.hop_table_cnt = 0;
	for (i = 0; i < 16; ++i)
	{
		static_set->rf.tx_powers[i].read_power = -2;
		static_set->rf.tx_powers[i].write_power = -2;
	}
	static_set->tag_data.unique_by_antenna = -1;
	static_set->tag_data.unique_by_bank_data = -1;
	static_set->tag_data.record_highest_rssi = -1;
	
	for (i = 0; i < 5; ++i)
		static_set->gpos[i] = 0;
	

	static_set->uart1.baud = 115200;
	static_set->uart1.data_bits = 0;
	static_set->uart1.parity = 0;
	static_set->uart1.type = 0;
	static_set->uart1.address = 2;
	static_set->uart1.stop_bits = 0;
	static_set->uart1.flow_ctrl = 0;
	
	static_set->uart2.baud = 115200;
	static_set->uart2.data_bits = 0;
	static_set->uart2.parity = 0;
	static_set->uart2.type = 1;
	static_set->uart2.address = 2;
	static_set->uart2.stop_bits = 0;
	static_set->uart2.flow_ctrl = 0;
}

void dump_static_settings(ReaderStaticSettings_ST *static_set)
{
#ifdef _DEBUG
	int i;
	TRACE("----------------------- dump_static_settings start\n");
	TRACE("reboot:%d\n", static_set->reboot);
	
	TRACE("inventory.cycle:%d\n", static_set->tagops_param.inventory.cycle);
	TRACE("inventory.interval:%d\n", static_set->tagops_param.inventory.interval);
	TRACE("inventory.inv_mode:%d\n", static_set->tagops_param.inventory.inv_mode);
	TRACE("inventory.ants:");
	for (i = 0; i < static_set->tagops_param.inventory.ants_cnt; ++i)
			printf("%d ", static_set->tagops_param.inventory.ants[i]);
	TRACE("\n");
	
	if (static_set->tagops_param.tagfilter.is_tagfilter == 1)
	{
		TRACE("tagfilter.bank:%d\n", static_set->tagops_param.tagfilter.bank);
		TRACE("tagfilter.start:%d\n", static_set->tagops_param.tagfilter.start);
		TRACE("tagfilter.match:%d\n", static_set->tagops_param.tagfilter.match);
		TRACE("tagfilter.mask_len:%d\n", static_set->tagops_param.tagfilter.mask_len);
		TRACE("tagfilter.mask:");
		for (i = 0; i < static_set->tagops_param.tagfilter.mask_len/8+1; ++i)
			TRACE("%02X ", static_set->tagops_param.tagfilter.mask[i]);
		TRACE("\n");
		TRACE("\n");
	}
	
	if (static_set->tagops_param.bankdata.is_bankdata == 1)
	{
		TRACE("bankdata.bank:%d\n", static_set->tagops_param.bankdata.bank);
		TRACE("bankdata.start:%d\n", static_set->tagops_param.bankdata.start);
		TRACE("bankdata.blkcnt:%d\n", static_set->tagops_param.bankdata.blkcnt);
//		printf("bankdata.pwd:%08X\n", GetNumU32(rt_set->bankdata.pwd));
	}

	TRACE("accessop: ant:%d, timeout:%d, pwd:%04X\n", static_set->tagops_param.accessop.ant, 
		static_set->tagops_param.accessop.timeout, 
		GetNumU32(static_set->tagops_param.accessop.aespwd));
	
