deeprfid/Scanner_Decoder/hc32f46_driver/trunk/user/src/readercfg.c
	TRACE("tagops_param.mb_sinv_tag_fmt:%04X\n", static_set->tagops_param.mb_sinv_tag_fmt);
	
	TRACE("app_init.usb_type:%d\n", static_set->app_init.usb_type);
	TRACE("app_init.max_tb_rec_len:%d\n", static_set->app_init.max_tb_rec_len);
	TRACE("app_init.evt_que_len:%d\n", static_set->app_init.evt_que_len);
	
	TRACE("protocol.gen2.session:%d\n", static_set->protocol.gen2.session);
	TRACE("protocol.gen2.q:%d\n", static_set->protocol.gen2.q);
	TRACE("protocol.gen2.target:%d\n", static_set->protocol.gen2.target);
	TRACE("protocol.gen2.profile:%d\n", static_set->protocol.gen2.profile);	
	
	TRACE("rf.ant_max_dwell_time:%d\n", static_set->rf.ant_max_dwell_time);
	TRACE("rf.hop_mode:%d\n", static_set->rf.hop_mode);
	TRACE("rf.region:%d\n", static_set->rf.region);
	if (static_set->rf.hop_table_cnt != 0)
	{		
		TRACE("hoptable:");
		for (i = 0; i < static_set->rf.hop_table_cnt; ++i)
		{
			TRACE("%d ", static_set->rf.hop_table[i]);
		}
		TRACE("\n");
	}

	TRACE("tx_powers:");
	for (i = 0; i < 16; ++i)
	{
		if (static_set->rf.tx_powers[i].read_power != 0)
		{
			TRACE("%d %d ", i+1, static_set->rf.tx_powers[i].read_power);
			TRACE("%d, ", static_set->rf.tx_powers[i].write_power);
		}
	}
	TRACE("\n");

	
	TRACE("tag_data.unique_by_antenna:%d\n", static_set->tag_data.unique_by_antenna);
	TRACE("tag_data.unique_by_bank_data:%d\n", static_set->tag_data.unique_by_bank_data);
	TRACE("tag_data.record_highest_rssi:%d\n", static_set->tag_data.record_highest_rssi);
	
	TRACE("gpos:");
	for (i = 0; i < 5; ++i)
		TRACE("%d %d, ", i+1, static_set->gpos[i]);		
	TRACE("\n");
	
	
	TRACE("uart1.address:%d\n", static_set->uart1.address);
	TRACE("uart1.baud:%d\n", static_set->uart1.baud);
	TRACE("uart1.data_bits:%d\n", static_set->uart1.data_bits);
	TRACE("uart1.stop_bits:%d\n", static_set->uart1.stop_bits);
	TRACE("uart1.flow_ctrl:%d\n", static_set->uart1.flow_ctrl);
	TRACE("uart1.parity:%d\n", static_set->uart1.parity);
	TRACE("uart1.type:%d\n", static_set->uart1.type);

	TRACE("uart2.address:%d\n", static_set->uart2.address);
	TRACE("uart2.baud:%d\n", static_set->uart2.baud);
	TRACE("uart2.data_bits:%d\n", static_set->uart2.data_bits);
	TRACE("uart2.stop_bits:%d\n", static_set->uart2.stop_bits);
	TRACE("uart2.flow_ctrl:%d\n", static_set->uart2.flow_ctrl);
	TRACE("uart2.parity:%d\n", static_set->uart2.parity);
	TRACE("uart2.type:%d\n", static_set->uart2.type);
	
	if (static_set->is_ethernet == 1)
		dump_network_config(&static_set->ethernet);
	
	if (static_set->uart_ex_type == Uart_Ex_Wlan)
		dump_wlan_config(&static_set->uart_ex.wlan);
	
	if (static_set->uart_ex_type == Uart_Ex_Bluetooth)
		dump_bluetooth_config(&static_set->uart_ex.ble);

	if (static_set->uart_ex_type == Uart_Ex_4G)
		dump_monet_config(&static_set->uart_ex.monet);
	
	TRACE("----------------------- dump_static_settings end\n");
#endif
}


void Str2Binary(const char *buf,int len,unsigned char *binarybuf);
void dump_runtime_settings(ReaderRunTimeSettings_ST *rt_set)
{
#ifdef _DEBUG
	int i;

	TRACE("---------------------- dump_runtime_settings start\n");
	TRACE("glob_params.hb_cylce:%d\n", rt_set->glob_params.hb_cylce);
	TRACE("glob_params.s_buf_size:%d\n", rt_set->glob_params.s_buf_size);
	TRACE("glob_params.name:%s\n", (char *)rt_set->glob_params.name);
	TRACE("\n");
	/*
	printf("inventory.cycle:%d\n", rt_set->inventory.cycle);
	printf("inventory.interval:%d\n", rt_set->inventory.interval);
	printf("inventory.inv_mode:%d\n", rt_set->inventory.inv_mode);
	printf("inventory.ants:");
	for (i = 0; i < 16; ++i)
	{
		if (rt_set->inventory.ants[i] != 0)
			printf("%d ", i+1);
	}
	printf("\n");
	
	if (rt_set->tagfilter.is_tagfilter == 1)
	{
		printf("tagfilter.bank:%d\n", rt_set->tagfilter.bank);
		printf("tagfilter.start:%d\n", rt_set->tagfilter.start);
		printf("tagfilter.match:%d\n", rt_set->tagfilter.match);
		printf("tagfilter.mask_len:%d\n", rt_set->tagfilter.mask_len);
		printf("tagfilter.mask:");
		for (i = 0; i < rt_set->tagfilter.mask_len/8+1; ++i)
			printf("%02X ", rt_set->tagfilter.mask[i]);
		printf("\n");
		printf("\n");
	}
	
	if (rt_set->bankdata.is_bankdata == 1)
	{
		printf("bankdata.bank:%d\n", rt_set->bankdata.bank);
		printf("bankdata.start:%d\n", rt_set->bankdata.start);
		printf("bankdata.blkcnt:%d\n", rt_set->bankdata.blkcnt);
		printf("bankdata.pwd:%08X\n", GetNumU32(rt_set->bankdata.pwd));
	}
	*/
	TRACE("upload.data_aggr.mode:%d\n", rt_set->upload.data_aggr.mode);
	TRACE("upload.data_aggr.timeval:%d\n", rt_set->upload.data_aggr.timeval);
	TRACE("upload.hw_inf:%d\n", rt_set->upload.hw_inf);
	TRACE("upload.sw_potl:%d\n", rt_set->upload.sw_potl);
	
	if (rt_set->upload.hw_inf == Upload_Inf_Ethernet || 
		rt_set->upload.hw_inf == Upload_Inf_4G || 
		rt_set->upload.hw_inf == Upload_Inf_Wifi)
	{
		if (rt_set->upload.sw_potl == Upload_Trans_Potl_Tcp)
		{
			TRACE("upload.sw_potl_params.tcp.ser_ip:%s\n", rt_set->upload.sw_potl_params.tcp.ser_ip);
			TRACE("upload.sw_potl_params.tcp.ser_port:%d\n", rt_set->upload.sw_potl_params.tcp.ser_port);
		}
		else if (rt_set->upload.sw_potl == Upload_Trans_Potl_Http)
		{
			TRACE("upload.sw_potl_params.http:\n");
			TRACE("url:%s\n", rt_set->upload.sw_potl_params.http.url);
		}
		else if (rt_set->upload.sw_potl == Upload_Trans_Potl_Mqtt)
		{
			TRACE("upload.sw_potl_params.mqtt:\n");
			TRACE("host:%s\n", rt_set->upload.sw_potl_params.mqtt.host);
			TRACE("port:%d\n", rt_set->upload.sw_potl_params.mqtt.port);
			TRACE("user:%s\n", rt_set->upload.sw_potl_params.mqtt.user);
			TRACE("pwd:%s\n", rt_set->upload.sw_potl_params.mqtt.pwd);
			TRACE("kal_time:%d\n", rt_set->upload.sw_potl_params.mqtt.kal_time);
			TRACE("sub_b_topic:%s\n", rt_set->upload.sw_potl_params.mqtt.sub_b_topic);
			TRACE("sub_b_qos:%d\n", rt_set->upload.sw_potl_params.mqtt.sub_b_qos);
			TRACE("sub_u_topic:%s\n", rt_set->upload.sw_potl_params.mqtt.sub_u_topic);
			TRACE("sub_u_qos:%d\n", rt_set->upload.sw_potl_params.mqtt.sub_u_qos);
			TRACE("pub_topic:%s\n", rt_set->upload.sw_potl_params.mqtt.pub_topic);
			TRACE("pub_qos:%d\n", rt_set->upload.sw_potl_params.mqtt.pub_qos);
			TRACE("tls:%d\n", rt_set->upload.sw_potl_params.mqtt.tls);			
		}
	}
	else if (rt_set->upload.hw_inf == Upload_Inf_Wiegand)
	{
		TRACE("wiegand.type:%d\n", rt_set->upload.sw_potl_params.wiegand.type);
		TRACE("wiegand.pls_width:%d\n", rt_set->upload.sw_potl_params.wiegand.pls_width);
		TRACE("wiegand.pls_interval:%d\n", rt_set->upload.sw_potl_params.wiegand.pls_interval);
		TRACE("wiegand.data_interval:%d\n", rt_set->upload.sw_potl_params.wiegand.data_interval);
		TRACE("wiegand.bytes_order:%d\n", rt_set->upload.sw_potl_params.wiegand.bytes_order);		
	}
	
	TRACE("upload.client_ack:%d\n", rt_set->upload.client_ack);
	TRACE("upload.crc_enable:%d\n", rt_set->upload.crc_enable);
	TRACE("upload.recv_timeout:%d\n", rt_set->upload.recv_timeout);
	TRACE("upload.clr_r_buf_time:%d\n", rt_set->upload.clr_r_buf_time);
	TRACE("\n");
	
	if (rt_set->gpi_trigger.is_gpi_trigger == 1)
	{
		TRACE("gpi_trigger.mode:%d\n", rt_set->gpi_trigger.mode);
		TRACE("gpi_trigger.timeval:%d\n", rt_set->gpi_trigger.timeval);
		if (rt_set->gpi_trigger.mode == 5)
			TRACE("gpi_trigger.timeval2:%d\n", rt_set->gpi_trigger.timeval2);
		TRACE("gpi_trigger.cond_1:");
		for (i = 0; i < rt_set->gpi_trigger.cond_1.count; ++i)
			TRACE("%d %d, ", rt_set->gpi_trigger.cond_1.ids[i], 
				rt_set->gpi_trigger.cond_1.states[i]);
		TRACE("\n");
		if (rt_set->gpi_trigger.mode != 2)
		{
			TRACE("gpi_trigger.cond_2:");
			for (i = 0; i < rt_set->gpi_trigger.cond_2.count; ++i)
				TRACE("%d %d,", rt_set->gpi_trigger.cond_2.ids[i], 
					rt_set->gpi_trigger.cond_2.states[i]);
			TRACE("\n");
		}
		TRACE("\n");
	}
	
	if (rt_set->gpo_act.count > 0)
	{
		TRACE("gpo_act:");
		for (i = 0; i < rt_set->gpo_act.count; ++i)
			TRACE("%d %d %d,", rt_set->gpo_act.ids[i], 
				rt_set->gpo_act.states[i], rt_set->gpo_act.durs[i]);
		TRACE("\n");
	}
	
	if (rt_set->events.count > 0)
	{
		TRACE("events:");
		for (i = 0; i < rt_set->events.count; ++i)
			printf("%d ", rt_set->events.ids[i]);
		TRACE("\n");
	}
	
	TRACE("tag_json_format:%04X\n", rt_set->tag_json_format);
	TRACE("cus_param:%s\n", (char *)rt_set->cus_param.param);
	
	TRACE("---------------------- dump_runtime_settings end\n");
#endif
}

int valid_runtime_settings_byobj(json_value *jvalue, 
	ReaderRunTimeSettings_ST *rt_set)
{
	json_value *obj;
	json_value *tmpobj;
	int pvalint;
	int i;
	int exflag;
	
