deeprfid/Scanner_Decoder/hc32f46_driver/trunk/user/src/readercfg.c
				PARSE_CHK_RANGE(obj->u.array.values[i], "dur", rt_set->gpo_act.durs[i], 5, 86400000, 1);				
			}
			rt_set->gpo_act.count = gacnt;
		}
		else
		{
			TRACE("gpo_act type error\n");
			return -1;
		}
	}
	
	if (json_getobject(jvalue, "tag_json_format", &obj) == 0)
	{
		if (obj->type == json_array)
		{
			int tjfcnt = obj->u.array.length;
			char tmpselbuf[8];
			int tjfid;
			
			if (tjfcnt > 9)
			{
				TRACE("tag_json_format obj length is invalid\n");
				return -1;
			}
			rt_set->tag_json_format = 0;
			for (i = 0; i < tjfcnt; ++i)
			{
				sprintf(tmpselbuf, "[%d]", i);
				if (json_getint(obj, tmpselbuf, &tjfid) != 0)
				{
					TRACE("tag_json_format item is invalid\n");
					return -1;
				}
				rt_set->tag_json_format |= 1 << tjfid;
			}
		}
		else
		{
			TRACE("tag_json_format obj type is invalid\n");
			return -1;
		}				
	}
	
	if (json_getobject(jvalue, "events", &obj) == 0)
	{
		if (obj->type == json_array)
		{
			int ecnt = obj->u.array.length;
			char tmpselbuf[8];
			int eid;
			
			if (ecnt > 10)
			{
				TRACE("events obj length is invalid\n");
				return -1;
			}
			for (i = 0; i < ecnt; ++i)
			{
				sprintf(tmpselbuf, "[%d]", i);
				if (json_getint(obj, tmpselbuf, &eid) != 0)
				{
					TRACE("events item is invalid\n");
					return -1;
				}		
				rt_set->events.ids[i] = eid;
			}
			rt_set->events.count = ecnt;
		}
		else
		{
			TRACE("events obj type is invalid\n");
			return -1;
		}		
	}
	return 0;	
}

int valid_runtime_settings(char *buf, int blen, ReaderRunTimeSettings_ST *rt_set)
{
	json_value *jvalue;
	
	jvalue = json_parse(buf, blen);
	if (jvalue == NULL)
	{
		TRACE("valid_runtime_settings jvalue == NULL\n");
		return -1;
	}
	return valid_runtime_settings_byobj(jvalue, rt_set);
}
int check_runtime_settings(ReaderRunTimeSettings_ST *rt_set)
{
	if (rt_set->upload.hw_inf == 0)					
		return -1;
	else
	{
		if (Upload_Inf_Ethernet == rt_set->upload.hw_inf)
		{
			if (get_spi_ex_dev() != Spi_Ex_Ethernet)
				return -1;
		}
		else if (Upload_Inf_4G == rt_set->upload.hw_inf)
		{
			if (get_uart_ex_dev() != Uart_Ex_4G)
				return -1;
		}
		else if (Upload_Inf_Wifi == rt_set->upload.hw_inf)
		{
			if (get_uart_ex_dev() != Uart_Ex_Wlan)
				return -1;
		}

		if (rt_set->upload.hw_inf == Upload_Inf_Ethernet || 
					rt_set->upload.hw_inf == Upload_Inf_4G || 
					rt_set->upload.hw_inf == Upload_Inf_Wifi)
		{
			if (rt_set->upload.sw_potl == Upload_Trans_Potl_None)
				return -1;
		}
	}
	
	return 0;
}

int cmd_config_runtime_settings(json_value *jvalue, 
	char *cfg_name, char *buf, int blen)
{
	ReaderRunTimeSettings_ST *rrtsettings;
	int validret;
	
	rrtsettings = malloc_hexp(sizeof(ReaderRunTimeSettings_ST));
	if (jvalue == NULL)
		validret = valid_runtime_settings(buf, blen, rrtsettings);
	else
		validret = valid_runtime_settings_byobj(jvalue, rrtsettings);
	
	if (validret == 0)
	{
		setdef_rdr_runtime_settings(rrtsettings);
		if (rrtsettings->reset == 0)
			get_rdr_runtime_settings(rrtsettings);
		if (jvalue == NULL)
			validret = valid_runtime_settings(buf, blen, rrtsettings);
		else
		{
			json_value *obj1;
			json_value *obj2;
			obj1 = json_parse(buf, blen);
			if (obj1 != NULL)
			{
				if (json_getobject(obj1, cfg_name, &obj2) == 0)
					validret = valid_runtime_settings_byobj(obj2, rrtsettings);
				else
				{
					TRACE("valid_runtime_settings_byobj(obj2, rrtsettings) failed\n");
					validret = -1;
				}
			}
			else
			{
				TRACE("cmd_config_static_settings obj1 == NULL\n");
				validret = -1;		
			}
		}
	
		if (validret == 0)
		{
			dump_runtime_settings(rrtsettings);
			validret = check_runtime_settings(rrtsettings);
			if (validret == 0)
			{
				set_rdr_runtime_settings(rrtsettings);
				sleep_ms(200);
				set_workmode_params(WorkMode_ActVer_2);
			}
		}
	}
	
	free_hexp(rrtsettings);
	return validret;
}

void Data2BinStr(unsigned char *buf, int bitlen, char *str)
{
	*str = 0;
	int tmp;
	char tmpbuf[10];
	int i;
	for (i = 0; i < bitlen/8; ++i)
	{
		for (int j = 0; j < 8; ++j)
		{
			tmp = (buf[i] >> (7 - j)) & 0x1;
			sprintf(tmpbuf, "%d", tmp);
			strcat(str, tmpbuf);
		}
	}

	for (int c = 0; c < bitlen % 8; ++c)
	{
		tmp = (buf[i] >> (7 - c)) & 0x1;
		sprintf(tmpbuf, "%d", tmp);
		strcat(str, tmpbuf);
	}
}

void setdef_rdr_runtime_settings(ReaderRunTimeSettings_ST *rt_set)
{
//	int i;
	
	rt_set->tag_json_format = 0x0007;
	rt_set->glob_params.hb_cylce = 10;
	rt_set->glob_params.s_buf_size = 1580;
	if (get_spi_ex_dev() == Spi_Ex_Ethernet)
		sprintf(rt_set->glob_params.name, "%02X%02X%02X%02X%02X%02X", 
			gNetConf.mac[0], gNetConf.mac[1], gNetConf.mac[2], gNetConf.mac[3], 
			gNetConf.mac[4], gNetConf.mac[5]);
	else
		rt_set->glob_params.name[0] = 0;
	
//	rt_set->bankdata.is_bankdata = 0;
	
	rt_set->cus_param.param[0] = 0;
	rt_set->cus_param.len = 0;
	
	rt_set->events.count = 2;
	
	rt_set->events.ids[0] = rdr_rt_evt_TagRead;
	rt_set->events.ids[1] = rdr_rt_evt_HeartBeat;
	
	memset(&rt_set->gpi_trigger, 0, sizeof(rdr_rt_set_gpi_trigger));
	
	rt_set->gpi_trigger.cond_order = 1;
	
	rt_set->gpo_act.count = 0;
	/*
	for (i = 0; i < 16; ++i)
		rt_set->inventory.ants[i] = 0;
	rt_set->inventory.interval = 10;
	rt_set->inventory.cycle = 150;
	rt_set->inventory.inv_mode = 0;
	
	rt_set->tagfilter.is_tagfilter = 0;
	*/
	rt_set->upload.hw_inf = 0;
	rt_set->upload.sw_potl = 0;
	rt_set->upload.data_aggr.mode = 1;
	rt_set->upload.data_aggr.timeval = 2000;
	rt_set->upload.client_ack = 0;
	rt_set->upload.crc_enable = 1;
	rt_set->upload.recv_timeout = 10;
	rt_set->upload.clr_r_buf_time = 8;
//	memset(rt_set->bankdata.pwd, 0, 4);
}

void tojson_rdr_runtime_settings(ReaderRunTimeSettings_ST *rt_set, char *jstart, int *len)
{
	int i;
//	int isants = 0;
	
	sprintf(jstart, "{\"glob_params\":{\"hb_cylce\":%d,\"s_buf_size\":%d,\"name\":\"%s\"},", 
		rt_set->glob_params.hb_cylce, rt_set->glob_params.s_buf_size, rt_set->glob_params.name);

	sprintf(jstart+strlen(jstart),"\"upload\":{\"client_ack\":%d,\"crc_enable\":%d,\"recv_timeout\":%d,\"clr_r_buf_time\":%d,\"hw_inf\":%d,", 
		rt_set->upload.client_ack, rt_set->upload.crc_enable, rt_set->upload.recv_timeout, rt_set->upload.clr_r_buf_time, rt_set->upload.hw_inf);
	if (rt_set->upload.hw_inf == Upload_Inf_Ethernet || 
		rt_set->upload.hw_inf == Upload_Inf_4G || 
		rt_set->upload.hw_inf == Upload_Inf_Wifi)
	{
		if (rt_set->upload.sw_potl == Upload_Trans_Potl_Tcp)
			sprintf(jstart+strlen(jstart), "\"tcp\":{\"ser_ip\":\"%s\",\"ser_port\":%d},",
				rt_set->upload.sw_potl_params.tcp.ser_ip, rt_set->upload.sw_potl_params.tcp.ser_port);
		else if (rt_set->upload.sw_potl == Upload_Trans_Potl_Http)
			sprintf(jstart+strlen(jstart), "\"http\":{\"url\":\"%s\"},", rt_set->upload.sw_potl_params.http.url);
		else if (rt_set->upload.sw_potl == Upload_Trans_Potl_Mqtt)
		{
			sprintf(jstart+strlen(jstart), "\"mqtt\":{\"host\":\"%s\",\"port\":%d,\"kal_time\":%d,\"pub_topic\":\"%s\",\"pub_qos\":%d,", 
			rt_set->upload.sw_potl_params.mqtt.host, rt_set->upload.sw_potl_params.mqtt.port, 
			rt_set->upload.sw_potl_params.mqtt.kal_time, rt_set->upload.sw_potl_params.mqtt.pub_topic, 
			rt_set->upload.sw_potl_params.mqtt.pub_qos);
			sprintf(jstart+strlen(jstart), "\"user\":\"%s\",", rt_set->upload.sw_potl_params.mqtt.user);
			sprintf(jstart+strlen(jstart), "\"pwd\":\"%s\",", rt_set->upload.sw_potl_params.mqtt.pwd);
			sprintf(jstart+strlen(jstart), "\"sub_b_topic\":\"%s\",", rt_set->upload.sw_potl_params.mqtt.sub_b_topic);
			sprintf(jstart+strlen(jstart), "\"sub_b_qos\":%d,", rt_set->upload.sw_potl_params.mqtt.sub_b_qos);
			sprintf(jstart+strlen(jstart), "\"sub_u_topic\":\"%s\",", rt_set->upload.sw_potl_params.mqtt.sub_u_topic);			
			sprintf(jstart+strlen(jstart), "\"sub_u_qos\":%d,", rt_set->upload.sw_potl_params.mqtt.sub_u_qos);
			sprintf(jstart+strlen(jstart), "\"tls\":%d},", rt_set->upload.sw_potl_params.mqtt.tls);
		}
	}
	else if (rt_set->upload.hw_inf == Upload_Inf_Wiegand)
		sprintf(jstart+strlen(jstart), "\"wiegand\":{\"type\":%d,\"pls_width\":%d,\"pls_interval\":%d,\"data_interval\":%d,\"bytes_order\":%d},", 
			rt_set->upload.sw_potl_params.wiegand.type, rt_set->upload.sw_potl_params.wiegand.pls_width, 
			rt_set->upload.sw_potl_params.wiegand.pls_interval, rt_set->upload.sw_potl_params.wiegand.data_interval,
			rt_set->upload.sw_potl_params.wiegand.bytes_order);
	
	sprintf(jstart+strlen(jstart), "\"data_aggr\":{\"mode\":%d,\"timeval\":%d}", 
		rt_set->upload.data_aggr.mode, rt_set->upload.data_aggr.timeval);
	sprintf(jstart+strlen(jstart), "},");
	
	if (rt_set->gpi_trigger.is_gpi_trigger == 1)
	{
		if (rt_set->gpi_trigger.mode != 5)
			sprintf(jstart+strlen(jstart),"\"gpi_trigger\":{\"mode\":%d,\"cond_order\":%d,\"timeval\":%d,\"cond_1\":[", 
				rt_set->gpi_trigger.mode, rt_set->gpi_trigger.cond_order, rt_set->gpi_trigger.timeval);
		else
			sprintf(jstart+strlen(jstart),"\"gpi_trigger\":{\"mode\":%d,\"cond_order\":%d,\"timeval\":%d,\"timeval2\":%d,\"cond_1\":[", 
				rt_set->gpi_trigger.mode, rt_set->gpi_trigger.cond_order, rt_set->gpi_trigger.timeval, rt_set->gpi_trigger.timeval2);
		
