deeprfid/Scanner_Decoder/hc32f46_driver/trunk/user/src/readercfg.c
		for (i = 0; i < rt_set->gpi_trigger.cond_1.count; ++i)
		{
			sprintf(jstart+strlen(jstart), "{\"id\":%d,\"state\":%d},", rt_set->gpi_trigger.cond_1.ids[i], 
				rt_set->gpi_trigger.cond_1.states[i]);
		}
		sprintf(jstart+strlen(jstart)-1, "],");
		
		if (rt_set->gpi_trigger.mode != 2)
		{
			sprintf(jstart+strlen(jstart), "\"cond_2\":[");
			for (i = 0; i < rt_set->gpi_trigger.cond_2.count; ++i)
				sprintf(jstart+strlen(jstart), "{\"id\":%d,\"state\":%d},", rt_set->gpi_trigger.cond_2.ids[i], 
					rt_set->gpi_trigger.cond_2.states[i]);

			sprintf(jstart+strlen(jstart)-1, "]");
		}

		sprintf(jstart+strlen(jstart), "},");
	}
	
	if (rt_set->gpo_act.count > 0)
	{
		sprintf(jstart+strlen(jstart), "\"gpo_act\":[");
		for (i = 0; i < rt_set->gpo_act.count; ++i)
		{
			sprintf(jstart+strlen(jstart), "{\"id\":%d,\"state\":%d,\"dur\":%d},", rt_set->gpo_act.ids[i], 
				rt_set->gpo_act.states[i], rt_set->gpo_act.durs[i]);	
		}
		sprintf(jstart+strlen(jstart)-1, "],");
	}
	
	if (rt_set->events.count > 0)
	{
		sprintf(jstart+strlen(jstart), "\"events\":[");
		for (i = 0; i < rt_set->events.count; ++i)
			sprintf(jstart+strlen(jstart), "%d,", rt_set->events.ids[i]);	

		sprintf(jstart+strlen(jstart)-1, "],");
	}
	
	
	if (rt_set->tag_json_format > 0)
	{
		sprintf(jstart+strlen(jstart), "\"tag_json_format\":[");
		for (i = 0; i < 16; ++i)
		{
			if (((rt_set->tag_json_format >> i) & 0x01) == 0x01)
				sprintf(jstart+strlen(jstart), "%d,", i);
		}
		sprintf(jstart+strlen(jstart)-1, "],");		
	}
	else
		sprintf(jstart+strlen(jstart), "\"tag_json_format\":[],");
	
	if (rt_set->cus_param.len > 0)
		sprintf(jstart+strlen(jstart), "\"cus_param\":\"%s\",", (char *)rt_set->cus_param.param);
	
	sprintf(jstart+strlen(jstart)-1, "}");

	*len = strlen(jstart);
//	TRACE("len:%d, tojson_rdr_runtime_settings:%s\n", *len, jstart);	
}

int valid_wlan_config_byobj(json_value *jvalue, WlanConfig_ST *wlanst);
int valid_bluetooth_config_byobj(json_value *jvalue, 
	BluetoothConfig_ST *blest);
int valid_monet_config_byobj(json_value *jvalue, 
	MonetConfig_ST *blest);
int valid_static_settings_byobj(json_value *jvalue, 
	ReaderStaticSettings_ST *static_set)
{
	int gen2_prof_tab[] = {-2, -1, 0, 1, 2, 3, 16, 17, 18, 19, 20, 21, 101, 103, 105, 107, 111, 112, 113, 115};
	int gen2_session_tab[] = {-1, 0, 1, 2, 3};
	int gen2_target_tab[] = {-1, 0, 1, 2, 3};
	int gen2_q_tab[] = {-2, -1, 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15};
	int rf_region_tab[] = {-1, 0x01, 0x02, 0x07, 0x08, 0x03, 0x06, 0x0A, 0xFF, 0x04, 
								0x05, 0x0C, 0x0D, 0x0E, 0x0F, 0x10, 0x11, 0x12, 0x13, 0x14, 
								0x16, 0x17, 0x18, 0x19, 0x1A, 0x1B, 0x1C, 0x1D, 0x1E};
	int rf_hop_mode_tab[] = {-1, 0x00, 0x01, 0x02};
	int bool_tab[] = {-1, 0, 1};
	int baud_tab[] = {9600, 19200, 38400, 57600, 115200, 230400, 460800, 921600};
	int databit_tab[] = {0, 1};
	int stopbit_tab[] = {0, 1};
	int parity_tab[] = {0, 1, 2};
	int flow_ctrl_tab[] = {0, 1};
	int uarttype_tab[] = {0, 1};
//	int act_range_tab[] = {1, 2, 3};
	int reboot_tab[] = {0, 1};
	int i;
	int pvalint;

	json_value *obj;
	int exflag;

	PARSE_CHK_RANGE(jvalue, "reset", static_set->reset, 0, 1, 0);
	if (exflag == 0)
		static_set->reset = 0;
	
	PARSE_CHK_IN_TAB(jvalue, "reboot", static_set->reboot, reboot_tab, 0);
	
	if (json_getobject(jvalue, "app_init", &obj) == 0)
	{
		PARSE_CHK_RANGE(obj, "usb_type", static_set->app_init.usb_type, 1, 2, 0);
		PARSE_CHK_RANGE(obj, "max_tb_rec_len", static_set->app_init.max_tb_rec_len, 2, 190, 0);
		PARSE_CHK_RANGE(obj, "evt_que_len", static_set->app_init.evt_que_len, 30, 100, 0);
	}
	

	if (json_getobject(jvalue, "tagops_param.inventory", &obj) == 0)
	{
		json_value *tmpobj;
		
		PARSE_CHK_RANGE(obj, "cycle", static_set->tagops_param.inventory.cycle, 0, 0xffff, 0);

		PARSE_CHK_RANGE(obj, "interval", static_set->tagops_param.inventory.interval, 0, 0xffff, 0);

		PARSE_CHK_RANGE(obj, "inv_mode", static_set->tagops_param.inventory.inv_mode, -1, 20, 0);
		
		if (json_getobject(obj, "ants", &tmpobj) == 0)
		{
			if (tmpobj->type == json_array)
			{
				char tmpselbuf[8];
				int aid;
				int antcnt = tmpobj->u.array.length;
				if (antcnt > 16 || antcnt == 0)
				{
					TRACE("inv_ants obj length is invalid\n");
					return -1;
				}
					
				for (i = 0; i < antcnt; ++i)
				{
					sprintf(tmpselbuf, "[%d]", i);
					if (json_getint(tmpobj, tmpselbuf, &aid) != 0)
					{
						TRACE("inv_ants item %d dose not find\n", i);
						return -1;
					}
					if (aid < 1 && aid > gAntNumber)
					{
						TRACE("inv_ants item is invalid\n");
						return -1;
					}
					static_set->tagops_param.inventory.ants[i] = aid;
				}
				static_set->tagops_param.inventory.ants_cnt = antcnt;
				if (nonrep_int_array(static_set->tagops_param.inventory.ants, 
					antcnt) != 1)
				{
					TRACE("repeatable ant id\n");
					return -1;					
				}
			}
			else
			{
				TRACE("inventory.ants obj type is invalid\n");
				return -1;
			}
		}
	}
	
	if (json_getobject(jvalue, "tagops_param.tagfilter", &obj) == 0)
	{
		char *maskbuf;
		
		PARSE_CHK_RANGE(obj, "bank", static_set->tagops_param.tagfilter.bank, 1, 3, 1);
		
		PARSE_CHK_RANGE(obj, "start", static_set->tagops_param.tagfilter.start, 0, 65535, 1);
		
		PARSE_CHK_RANGE(obj, "match", static_set->tagops_param.tagfilter.match, 0, 1, 1);
		
		maskbuf = malloc_hexp(513);
		if (json_getstring_len(obj, "mask", 512, 2, maskbuf) != 0)
		{
			TRACE("mask dose not find\n");
			free_hexp(maskbuf);
			return -1;
		}
		
		Str2Binary(maskbuf, strlen(maskbuf), static_set->tagops_param.tagfilter.mask);
		static_set->tagops_param.tagfilter.mask_len = strlen(maskbuf);
		free_hexp(maskbuf);
		static_set->tagops_param.tagfilter.is_tagfilter = 1;
	}
	
	if (json_getobject(jvalue, "tagops_param.bankdata", &obj) == 0)
	{
		PARSE_CHK_RANGE(obj, "bank", static_set->tagops_param.bankdata.bank, 0, 3, 1);
		
		PARSE_CHK_RANGE(obj, "start", static_set->tagops_param.bankdata.start, 0, 255, 1);

		PARSE_CHK_RANGE(obj, "blkcnt", static_set->tagops_param.bankdata.blkcnt, 1, 16, 1);

		static_set->tagops_param.bankdata.is_bankdata = 1;
	}
	
	if (json_getobject(jvalue, "tagops_param.accessop", &obj) == 0)
	{
		char boppwd[10];
		
