deeprfid/Scanner_Decoder/hc32f46_driver/trunk/user/src/readercfg.c
		if (gAntNumber == -1)
		{
			PARSE_CHK_RANGE(obj, "ant", static_set->tagops_param.accessop.ant, 0, 16, 0);
		}
		else
		{
			PARSE_CHK_RANGE(obj, "ant", static_set->tagops_param.accessop.ant, 0, gAntNumber, 0);
		}
		
		PARSE_CHK_RANGE(obj, "timeout", static_set->tagops_param.accessop.timeout, 50, 65535, 0);
	
		PARSE_CHK_STR(obj, "aespwd", boppwd, 8, 0, 0);
		if (exflag)
		{
			if (strlen(boppwd) != 8)
			{
				TRACE("aespwd len is invalid\n");
				return -1;				
			}
			if (strTohex(boppwd, 8, static_set->tagops_param.accessop.aespwd) != 0)
			{
				TRACE("aespwd value is invalid\n");
				return -1;				
			}
		}
	}
	
	if (json_getobject(jvalue, "tagops_param.mb_sinv_tag_fmt", &obj) == 0)
	{
		if (obj->type == json_array)
		{
			int tjfcnt = obj->u.array.length;
			char tmpselbuf[8];
			int tjfid;
			
			if (tjfcnt > 6)
			{
				TRACE("mb_sinv_tag_fmt obj length is invalid\n");
				return -1;
			}
			static_set->tagops_param.mb_sinv_tag_fmt = 0;
			for (i = 0; i < tjfcnt; ++i)
			{
				sprintf(tmpselbuf, "[%d]", i);
				if (json_getint(obj, tmpselbuf, &tjfid) != 0)
				{
					TRACE("mb_sinv_tag_fmt item is invalid\n");
					return -1;
				}
				static_set->tagops_param.mb_sinv_tag_fmt |= 1 << tjfid;
			}
		}
		else
		{
			TRACE("mb_sinv_tag_fmt obj type is invalid\n");
			return -1;
		}			
	}
	
	if (json_getobject(jvalue, "protocol.gen2", &obj) == 0)
	{
		PARSE_CHK_IN_TAB(obj, "session", static_set->protocol.gen2.session, gen2_session_tab, 0);
			
		PARSE_CHK_IN_TAB(obj, "q", static_set->protocol.gen2.q, gen2_q_tab, 0);

		PARSE_CHK_IN_TAB(obj, "profile", static_set->protocol.gen2.profile, gen2_prof_tab, 0);
			
		PARSE_CHK_IN_TAB(obj, "target", static_set->protocol.gen2.target, gen2_target_tab, 0);
	}
		
	if (json_getobject(jvalue, "rf", &obj) == 0)
	{
		json_value *pwrobj;
		json_value *htbobj;

		PARSE_CHK_IN_TAB(obj, "region", static_set->rf.region, rf_region_tab, 0);

		PARSE_CHK_IN_TAB(obj, "hop_mode", static_set->rf.hop_mode, rf_hop_mode_tab, 0);
			
		PARSE_CHK_RANGE(obj, "ant_max_dwell_time", static_set->rf.ant_max_dwell_time, 0, 0xffff, 0);
		
		if (json_getobject(obj, "tx_powers", &pwrobj) == 0)
		{
			int aid;
			
			if (pwrobj->type == json_array)
			{
				int pwrcnt = pwrobj->u.array.length;
				if (pwrcnt == 0 || pwrcnt > 16)
				{
					TRACE("tx_powers obj length is invalid\n");
					return -1;
				}
				/*
				for (i = 0; i < 16; ++i)
				{
					static_set->rf.tx_powers[i].read_power = -1;
					static_set->rf.tx_powers[i].write_power = -1;
				}
				*/
				for (i = 0; i < pwrcnt; ++i)
				{
					PARSE_CHK_RANGE(pwrobj->u.array.values[i], "id", aid, 1, 16, 1);
					
					if (json_getint(pwrobj->u.array.values[i], "rp", &pvalint) == 0)
					{
						if (pvalint < -2 || pvalint > 3300)
						{
							TRACE("rp is invalid\n");
							return -1;
						}
						static_set->rf.tx_powers[aid-1].read_power = pvalint;
					}
					else
					{
						TRACE("rp not find\n");
						return -1;						
					}
					
					if (json_getint(pwrobj->u.array.values[i], "wp", &pvalint) == 0)
					{
						if (pvalint < -2 || pvalint > 3300)
						{
							TRACE("wp is invalid\n");
							return -1;
						}
						static_set->rf.tx_powers[aid-1].write_power = pvalint;
					}
					else
					{
						TRACE("wp not find\n");
						return -1;						
					}
				}
			}
			else
			{
				TRACE("tx_powers obj type is invalid\n");
				return -1;
			}
		}
		
		if (json_getobject(obj, "hop_table", &htbobj) == 0)
		{
			if (htbobj->type == json_array)
			{
				int htblen = htbobj->u.array.length;
				char tmpselbuf[8];
				
				if (htblen > 50)
				{
					TRACE("hop_table obj length is invalid\n");
					return -1;
				}
				for (i = 0; i < htblen; ++i)
				{
					sprintf(tmpselbuf, "[%d]", i);
					if (json_getint(htbobj, tmpselbuf, &static_set->rf.hop_table[i]) != 0)
					{
						TRACE("hop_table item is invalid\n");
						return -1;
					}
				}
				static_set->rf.hop_table_cnt = htblen;
			}
			else
			{
				TRACE("hop_table obj type is invalid\n");
				return -1;
			}
		}
	}
	
	if (json_getobject(jvalue, "tag_data", &obj) == 0)
	{
		PARSE_CHK_IN_TAB(obj, "unique_by_antenna", static_set->tag_data.unique_by_antenna, bool_tab, 0);
			
		PARSE_CHK_IN_TAB(obj, "unique_by_bank_data", static_set->tag_data.unique_by_bank_data, bool_tab, 0);
			
		PARSE_CHK_IN_TAB(obj, "record_highest_rssi", static_set->tag_data.record_highest_rssi, bool_tab, 0);			
	}
	
	if (json_getobject(jvalue, "gpos", &obj) == 0)
	{
		if (obj->type == json_array)
		{
			int gpocnt = obj->u.array.length;
			int gid;
			if (gpocnt > 5)
			{
				TRACE("gpos obj length is invalid\n");
				return -1;
			}

			if (gpocnt == 0)
			{
				for (i = 0; i < 5; ++i)
					static_set->gpos[i] = 0;
			}

			for (i = 0; i < gpocnt; ++i)
			{
				PARSE_CHK_RANGE(obj->u.array.values[i], "id", gid, 1, 5, 1);

				PARSE_CHK_RANGE(obj->u.array.values[i], "state", pvalint, 0, 1, 1);
				static_set->gpos[gid-1] = pvalint+1;
			}
		}
		else
		{
			TRACE("gpos obj type is invalid\n");
			return -1;
		}
	}
	

	if (json_getobject(jvalue, "uart1", &obj) == 0)
	{
		PARSE_CHK_IN_TAB(obj, "baud", static_set->uart1.baud, baud_tab, 0);
			
		PARSE_CHK_RANGE(obj, "address", static_set->uart1.address, 1, 254, 0);

		PARSE_CHK_IN_TAB(obj, "stop_bits", static_set->uart1.stop_bits, stopbit_tab, 0);
			
		PARSE_CHK_IN_TAB(obj, "data_bits", static_set->uart1.data_bits, databit_tab, 0);
			
		PARSE_CHK_IN_TAB(obj, "parity", static_set->uart1.parity, parity_tab, 0);
			
		PARSE_CHK_IN_TAB(obj, "flow_ctrl", static_set->uart1.flow_ctrl, flow_ctrl_tab, 0);
	}
	
	if (json_getobject(jvalue, "uart2", &obj) == 0)
	{
		PARSE_CHK_IN_TAB(obj, "baud", static_set->uart2.baud, baud_tab, 0);
			
		PARSE_CHK_RANGE(obj, "address", static_set->uart2.address, 1, 254, 0);
		
		PARSE_CHK_IN_TAB(obj, "type", static_set->uart2.type, uarttype_tab, 0);

		PARSE_CHK_IN_TAB(obj, "stop_bits", static_set->uart2.stop_bits, stopbit_tab, 0);
			
		PARSE_CHK_IN_TAB(obj, "data_bits", static_set->uart2.data_bits, databit_tab, 0);
			
		PARSE_CHK_IN_TAB(obj, "parity", static_set->uart2.parity, parity_tab, 0);
			
		PARSE_CHK_IN_TAB(obj, "flow_ctrl", static_set->uart2.flow_ctrl, flow_ctrl_tab, 0);
	}
	
	static_set->is_ethernet = 0;
	if (json_getobject(jvalue, "ethernet", &obj) == 0)
	{
		if (get_spi_ex_dev() == Spi_Ex_Ethernet)
		{
			memcpy(&static_set->ethernet, &gNetConf, sizeof(gNetConf));
			if (valid_ipinfo_cfg(obj, &static_set->ethernet) != 0)
			{
				TRACE("ethernet is invalid\n");
				return -1;		
			}
			static_set->is_ethernet = 1;
		}
		else
		{
			TRACE("no ethernet interface\n");
			return -1;	
		}
	}
	
	static_set->uart_ex_type = Uart_Ex_None;
	if (json_getobject(jvalue, "wlan", &obj) == 0)
	{
		if (get_uart_ex_dev() == Uart_Ex_Wlan)
		{
			setdef_wlan_config(&static_set->uart_ex.wlan);
			if (valid_wlan_config_byobj(obj, &static_set->uart_ex.wlan) != 0)
			{
				TRACE("wlan is invalid\n");
				return -1;		
			}
			static_set->uart_ex_type = Uart_Ex_Wlan;
		}
		else
		{
			TRACE("no wlan interface\n");
			return -1;	
		}
	}	
	
