deeprfid/Scanner_Decoder/hc32f46_driver/trunk/user/src/readercfg.c
	if (json_getobject(jvalue, "bluetooth", &obj) == 0)
	{
		if (get_uart_ex_dev() == Uart_Ex_Bluetooth)
		{
			setdef_bluetooth_config(&static_set->uart_ex.ble);
			if (valid_bluetooth_config_byobj(obj, &static_set->uart_ex.ble) != 0)
			{
				TRACE("bluetooth is invalid\n");
				return -1;		
			}
			static_set->uart_ex_type = Uart_Ex_Bluetooth;
		}
		else
		{
			TRACE("no bluetooth interface\n");
			return -1;	
		}
	}
	
	if (json_getobject(jvalue, "monet", &obj) == 0)
	{
		if (get_uart_ex_dev() == Uart_Ex_4G)
		{
			setdef_monet_config(&static_set->uart_ex.monet);
			if (valid_monet_config_byobj(obj, &static_set->uart_ex.monet) != 0)
			{
				TRACE("monet is invalid\n");
				return -1;		
			}
			static_set->uart_ex_type = Uart_Ex_4G;
		}
		else
		{
			TRACE("no monet interface\n");
			return -1;	
		}
	}
	
	return 0;
}

int valid_static_settings(char *buf, int blen, ReaderStaticSettings_ST *static_set)
{
	json_value *jvalue;
	
	jvalue = json_parse(buf, blen);
	if (jvalue == NULL)
	{
		TRACE("valid_static_settings jvalue == NULL\n");
		return -1;
	}
	return valid_static_settings_byobj(jvalue, static_set);
}

int cmd_config_static_settings(json_value *jvalue, char *cfg_name, 
	char *buf, int blen, int *reboot)
{
	ReaderStaticSettings_ST *rssettings;
	int validret;
	
	rssettings = malloc_hexp(sizeof(ReaderStaticSettings_ST));
	if (jvalue == NULL)
		validret = valid_static_settings(buf, blen, rssettings);
	else
		validret = valid_static_settings_byobj(jvalue, rssettings);
	
	if (validret == 0)
	{
		setdef_rdr_static_settings(rssettings);
		if (rssettings->reset == 0)
			get_rdr_static_settings(rssettings);

		if (jvalue == NULL)
			validret = valid_static_settings(buf, blen, rssettings);
		else
		{
			json_value *obj1;
			json_value *obj2;
			obj1 = json_parse(buf, blen);
			if (obj1 != NULL)
			{
				if (json_getobject(obj1, cfg_name, &obj2) == 0)
					validret = valid_static_settings_byobj(obj2, rssettings);
				else
				{
					TRACE("valid_static_settings_byobj(obj2, rssettings) failed\n");
					validret = -1;
				}
			}
			else
			{
				TRACE("cmd_config_static_settings obj1 == NULL\n");
				validret = -1;		
			}
		}
		
		if (validret == 0)
		{
			dump_static_settings(rssettings);
			if (rssettings->is_ethernet == 1)
			{
				TRACE("if (rssettings->is_ethernet == 1)\n");
				set_network_config(&rssettings->ethernet);
				sleep_ms(150);
			}
			if (rssettings->uart_ex_type == Uart_Ex_Wlan)
			{
				TRACE("if (rssettings->uart_ex_type == Uart_Ex_Wlan)\n");
				set_wlan_config(&rssettings->uart_ex.wlan);
				sleep_ms(150);
			}
			if (rssettings->uart_ex_type == Uart_Ex_Bluetooth)
			{
				TRACE("if (rssettings->uart_ex_type == Uart_Ex_Bluetooth)\n");
				set_bluetooth_config(&rssettings->uart_ex.ble);
				sleep_ms(150);
			}
			if (rssettings->uart_ex_type == Uart_Ex_4G)
			{
				TRACE("if (rssettings->uart_ex_type == Uart_Ex_4G)\n");
				set_monet_config(&rssettings->uart_ex.monet);
				sleep_ms(150);
			}
			set_rdr_static_settings(rssettings);
			*reboot = rssettings->reboot;
		}
	}
	
	free_hexp(rssettings);
	return validret;
}
/*
int valid_modbus_uart(char *buf, int blen, rdr_st_set_modbus_uart *moduart)
{
	int baud_tab[] = {9600, 19200, 38400, 57600, 115200, 230400, 460800, 921600};
	int databit_tab[] = {0, 1};
	int stopbit_tab[] = {0, 1};
	int parity_tab[] = {0, 1, 2};
	int flow_ctrl_tab[] = {0, 1};
	int uarttype_tab[] = {0, 1};
//	int reset = 1;
	int pvalint;

	json_value *obj;
	
	moduart->is_modbus_uart = 0;
	
	obj = json_parse(buf, blen);
	if (obj == NULL)
	{
		TRACE("valid_modbus_uart jvalue == NULL\n");
		return -1;
	}

	PARSE_CHK_IN_TAB(obj, "baud", moduart->baud,  baud_tab, 1);
			
	PARSE_CHK_RANGE(obj, "address", moduart->address, 2, 255, 1);
		
	PARSE_CHK_IN_TAB(obj, "type", moduart->type, uarttype_tab, 1);

	PARSE_CHK_IN_TAB(obj, "stop_bits", moduart->stop_bits, stopbit_tab, 1);
			
	PARSE_CHK_IN_TAB(obj, "data_bits", moduart->data_bits, databit_tab, 1);
			
	PARSE_CHK_IN_TAB(obj, "parity", moduart->parity, parity_tab, 1);
			
	PARSE_CHK_IN_TAB(obj, "flow_ctrl", moduart->flow_ctrl, flow_ctrl_tab, 1);
	
	moduart->is_modbus_uart = 1;
	return 0;
}
*/
extern uint8 gMonetState;
void tojson_rdr_static_settings(ReaderStaticSettings_ST *static_set, 
	char *jstart, int *len, int isexcfg)
{
	int i;
	int isgpo = 0;
	
	sprintf(jstart, "{\"app_init\":{\"usb_type\":%d,\"max_tb_rec_len\":%d,\"evt_que_len\":%d},", 
		static_set->app_init.usb_type, static_set->app_init.max_tb_rec_len, static_set->app_init.evt_que_len);

	sprintf(jstart+strlen(jstart), "\"tagops_param\":{\"inventory\":{\"cycle\":%d,\"interval\":%d,\"inv_mode\":%d,",
		static_set->tagops_param.inventory.cycle, static_set->tagops_param.inventory.interval, 
		static_set->tagops_param.inventory.inv_mode);
	
	if (static_set->tagops_param.inventory.ants_cnt > 0)
	{
		sprintf(jstart+strlen(jstart), "\"ants\":[");
		for (i = 0; i < static_set->tagops_param.inventory.ants_cnt; ++i)
			sprintf(jstart+strlen(jstart), "%d,",static_set->tagops_param.inventory.ants[i]);

		sprintf(jstart+strlen(jstart)-1, "],");
	}
	sprintf(jstart+strlen(jstart)-1, "},");

	if (static_set->tagops_param.tagfilter.is_tagfilter == 1)
	{
		char *binstr;

		sprintf(jstart+strlen(jstart), "\"tagfilter\":{\"bank\":%d,\"start\":%d,\"match\":%d,\"mask\":\"", 
			static_set->tagops_param.tagfilter.bank, static_set->tagops_param.tagfilter.start, 
			static_set->tagops_param.tagfilter.match);
		
		binstr = malloc_hexp(513);
		Data2BinStr(static_set->tagops_param.tagfilter.mask, 
			static_set->tagops_param.tagfilter.mask_len, binstr);
		sprintf(jstart+strlen(jstart), "%s\"},", binstr);
		free_hexp(binstr);
	}
	
	if (static_set->tagops_param.bankdata.is_bankdata == 1)
		sprintf(jstart+strlen(jstart), "\"bankdata\":{\"bank\":%d,\"start\":%d,\"blkcnt\":%d},", 
			static_set->tagops_param.bankdata.bank, static_set->tagops_param.bankdata.start, 
			static_set->tagops_param.bankdata.blkcnt);

	sprintf(jstart+strlen(jstart), "\"accessop\":{\"ant\":%d,\"timeout\":%d,", 
		static_set->tagops_param.accessop.ant, static_set->tagops_param.accessop.timeout);
	if (GetNumU32(static_set->tagops_param.accessop.aespwd) != 0)
		sprintf(jstart+strlen(jstart), "\"aespwd\":\"%08X\"},", 
			GetNumU32(static_set->tagops_param.accessop.aespwd));
	else
		sprintf(jstart+strlen(jstart)-1, "},");
	
	if (static_set->tagops_param.mb_sinv_tag_fmt > 0)
	{
		sprintf(jstart+strlen(jstart), "\"mb_sinv_tag_fmt\":[");
		for (i = 0; i < 16; ++i)
		{
			if (((static_set->tagops_param.mb_sinv_tag_fmt >> i) & 0x01) == 0x01)
				sprintf(jstart+strlen(jstart), "%d,", i);
		}
		sprintf(jstart+strlen(jstart)-1, "],");		
	}
	else
		sprintf(jstart+strlen(jstart), "\"mb_sinv_tag_fmt\":[],");
	
	sprintf(jstart+strlen(jstart)-1, "},");
	
	sprintf(jstart+strlen(jstart), "\"protocol\":{\"gen2\":{\"session\":%d,\"q\":%d,\"target\":%d,\"profile\":%d}},", 
		static_set->protocol.gen2.session, static_set->protocol.gen2.q, static_set->protocol.gen2.target, 
		static_set->protocol.gen2.profile);

	sprintf(jstart+strlen(jstart), "\"rf\":{\"ant_max_dwell_time\":%d,\"hop_mode\":%d,\"region\":%d,", 
		static_set->rf.ant_max_dwell_time, static_set->rf.hop_mode, static_set->rf.region);	

	if (static_set->rf.hop_table_cnt != 0)
	{
		sprintf(jstart+strlen(jstart), "\"hop_table\":[");
		for (i = 0; i < static_set->rf.hop_table_cnt; ++i)
			sprintf(jstart+strlen(jstart), "%d,", static_set->rf.hop_table[i]);

		sprintf(jstart+strlen(jstart)-1, "],");	
	}
		

	sprintf(jstart+strlen(jstart), "\"tx_powers\":[");
	if (gAntNumber == -1)
		sprintf(jstart+strlen(jstart), "],");
	else
	{
		for (i = 0; i < gAntNumber; ++i)
			sprintf(jstart+strlen(jstart), "{\"id\":%d,\"rp\":%d,\"wp\":%d},", i+1, static_set->rf.tx_powers[i].read_power, 
				static_set->rf.tx_powers[i].write_power);
		sprintf(jstart+strlen(jstart)-1, "],");
	}
	sprintf(jstart+strlen(jstart)-1, "},");
		

	sprintf(jstart+strlen(jstart), "\"tag_data\":{\"unique_by_antenna\":%d,\"unique_by_bank_data\":%d,\"record_highest_rssi\":%d},", 
		static_set->tag_data.unique_by_antenna, static_set->tag_data.unique_by_bank_data, 
		static_set->tag_data.record_highest_rssi);		

	for (i = 0; i < 4; ++i)
	{
		if (static_set->gpos[i] != 0)
		{
			isgpo = 1;
			break;
		}
	}
	if (isgpo == 1)
	{
		sprintf(jstart+strlen(jstart), "\"gpos\":[");
		for (i = 0; i < 4; ++i)
		{
			if (static_set->gpos[i] != 0)
				sprintf(jstart+strlen(jstart), "{\"id\":%d,\"state\":%d},", i+1, 
					static_set->gpos[i]-1);
		}
		sprintf(jstart+strlen(jstart)-1, "],");
	}

	sprintf(jstart+strlen(jstart), "\"uart1\":{");
	sprintf(jstart+strlen(jstart), "\"type\":%d,", static_set->uart1.type);
	sprintf(jstart+strlen(jstart), "\"address\":%d,", static_set->uart1.address);
	sprintf(jstart+strlen(jstart), "\"baud\":%d,", static_set->uart1.baud);
	sprintf(jstart+strlen(jstart), "\"data_bits\":%d,", static_set->uart1.data_bits);
	sprintf(jstart+strlen(jstart), "\"stop_bits\":%d,", static_set->uart1.stop_bits);
	sprintf(jstart+strlen(jstart), "\"flow_ctrl\":%d,", static_set->uart1.flow_ctrl);
	sprintf(jstart+strlen(jstart), "\"parity\":%d},", static_set->uart1.parity);	

