deeprfid/Scanner_Decoder/hc32f46_driver/trunk/user/src/readercfg.c
	sprintf(jstart+strlen(jstart), "\"uart2\":{");
	sprintf(jstart+strlen(jstart), "\"type\":%d,", static_set->uart2.type);
	sprintf(jstart+strlen(jstart), "\"address\":%d,", static_set->uart2.address);
	sprintf(jstart+strlen(jstart), "\"baud\":%d,", static_set->uart2.baud);
	sprintf(jstart+strlen(jstart), "\"data_bits\":%d,", static_set->uart2.data_bits);
	sprintf(jstart+strlen(jstart), "\"stop_bits\":%d,", static_set->uart2.stop_bits);
	sprintf(jstart+strlen(jstart), "\"flow_ctrl\":%d,", static_set->uart2.flow_ctrl);
	sprintf(jstart+strlen(jstart), "\"parity\":%d},", static_set->uart2.parity);	
	
	if (get_spi_ex_dev() == Spi_Ex_Ethernet  && isexcfg == 1)
	{
		sprintf(jstart+strlen(jstart), "\"ethernet\":{");
		sprintf(jstart+strlen(jstart), "\"ip\":\"%d.%d.%d.%d\",", gNetConf.ip[0], 
			gNetConf.ip[1], gNetConf.ip[2], gNetConf.ip[3]);
		sprintf(jstart+strlen(jstart), "\"nm\":\"%d.%d.%d.%d\",", gNetConf.subnetMask[0], 
			gNetConf.subnetMask[1], gNetConf.subnetMask[2], gNetConf.subnetMask[3]);
		sprintf(jstart+strlen(jstart), "\"gw\":\"%d.%d.%d.%d\",", gNetConf.gatewayIP[0], 
			gNetConf.gatewayIP[1], gNetConf.gatewayIP[2], gNetConf.gatewayIP[3]);
		sprintf(jstart+strlen(jstart), "\"dns\":\"%d.%d.%d.%d\",", gNetConf.dnsServer[0], 
			gNetConf.dnsServer[1], gNetConf.dnsServer[2], gNetConf.dnsServer[3]);
		sprintf(jstart+strlen(jstart), "\"mac\":\"%02X%02X%02X%02X%02X%02X\",", gNetConf.mac[0], 
			gNetConf.mac[1], gNetConf.mac[2], gNetConf.mac[3], gNetConf.mac[4], gNetConf.mac[5]);
		sprintf(jstart+strlen(jstart), "\"lport\":%d},", gNetConf.listenPort);
	}
	
	if (get_uart_ex_dev() == Uart_Ex_Wlan && isexcfg == 1)
	{
		WlanConfig_ST *wlanconf = malloc_hexp(sizeof(WlanConfig_ST));
		int wclen;
		get_wlan_config(wlanconf);
		sprintf(jstart+strlen(jstart), "\"wlan\":");
		tojson_wlan_config(wlanconf, jstart+strlen(jstart), &wclen);
		sprintf(jstart+strlen(jstart), ",");
		free_hexp(wlanconf);
	}
	
	if (get_uart_ex_dev() == Uart_Ex_Bluetooth && isexcfg == 1)
	{
		BluetoothConfig_ST *blest = malloc_hexp(sizeof(BluetoothConfig_ST));
		int btlen;
		get_bluetooth_config(blest);
		
		sprintf(jstart+strlen(jstart), "\"bluetooth\":");
		tojson_bluetooth_config(blest, jstart+strlen(jstart), &btlen);
		sprintf(jstart+strlen(jstart), ",");
		free_hexp(blest);
	}
	
	if (get_uart_ex_dev() == Uart_Ex_4G && isexcfg == 1)
	{
		MonetConfig_ST *monst = malloc_hexp(sizeof(MonetConfig_ST));
		int molen;
		get_monet_config(monst);
		
		sprintf(jstart+strlen(jstart), "\"monet\":");
		tojson_monet_config(monst, jstart+strlen(jstart), &molen);
		sprintf(jstart+strlen(jstart), ",");
		free_hexp(monst);
	}		
	sprintf(jstart+strlen(jstart)-1, "}");
	
	*len = strlen(jstart);
//	TRACE("tojson_rdr_static_settings:%s\n", jstart);
}

int set_rdr_runtime_settings(ReaderRunTimeSettings_ST *rt_set)
{
	int err = 0;
	ConfReadBuffer confBuf;
	int pos = strlen(ActModeCfg_Marker);
	char *jstart;
	int jlen;
	E(pre_set_config(&confBuf));
	memcpy(confBuf.activemodecfgbuf, ActModeCfg_Marker, pos);
//	SetNumU16(confBuf.passivemodecfgbuf+pos, len);
	jstart = (char *)confBuf.activemodecfgbuf+pos+2;
	
	tojson_rdr_runtime_settings(rt_set, jstart, &jlen);
    deviceID_update(rt_set);
	set_eastag_to_flash();
	SetNumU16(confBuf.activemodecfgbuf+pos, jlen);
	E(set_config_to_flash(&confBuf));
FIN:
	return err;	
}

int set_rdr_static_settings(ReaderStaticSettings_ST *static_set)
{
	int err = 0;
	ConfReadBuffer confBuf;
	int pos = strlen(RdrStaticSets_Marker);
	char *jstart;
	int jlen;
	E(pre_set_config(&confBuf));
	memcpy(confBuf.passivemodecfgbuf, RdrStaticSets_Marker, pos);
//	SetNumU16(confBuf.passivemodecfgbuf+pos, len);
	jstart = (char *)confBuf.passivemodecfgbuf+pos+2;
	
	tojson_rdr_static_settings(static_set, jstart, &jlen, 0);

	SetNumU16(confBuf.passivemodecfgbuf+pos, jlen);
	E(set_config_to_flash(&confBuf));
FIN:
	return err;	
}

int get_rdr_runtime_settings(ReaderRunTimeSettings_ST *rt_set)
{
	int pos = strlen(ActModeCfg_Marker);
	char *rtbuf = malloc_hexp(MaxActiveModeConfigLen);
	
	if (rtbuf == NULL)
	{
		TRACE("get_rdr_runtime_settings:no enough memory\n");
		return -1;
	}
	
	setdef_rdr_runtime_settings(rt_set);
	flash_bytes_read(ActiveModeConfig_Addr, rtbuf, MaxActiveModeConfigLen);
	if (memcmp(ActModeCfg_Marker, rtbuf, pos) == 0)
	{
		int jsonlen = GetNumU16((uint8 *)rtbuf+pos);
		int vlret;
		pos += 2;
		vlret = valid_runtime_settings(rtbuf+pos, jsonlen, rt_set);
		TRACE("get_rdr_runtime_settings valid_runtime_settings vlret:%d\n", vlret);
		if (vlret != 0)
			{setdef_rdr_runtime_settings(rt_set);}
	    else
		  { deviceID_update(rt_set);}		
		free_hexp(rtbuf);
		
		return vlret;
	}
	else
	{
		setdef_rdr_runtime_settings(rt_set);
		TRACE("not find ActModeCfg_Marker\n");
		free_hexp(rtbuf);
		return -1;
	}
}

int get_rdr_static_settings(ReaderStaticSettings_ST *static_set)
{
	int pos = strlen(RdrStaticSets_Marker);
	char *passbuf = malloc_hexp(MaxPassiveModeConfigLen);
	
	if (passbuf == NULL)
	{
		TRACE("get_rdr_static_settings:no enough memory\n");
		return -1;
	}
	setdef_rdr_static_settings(static_set);
	
	flash_bytes_read(PassiveModeConfig_Addr, passbuf, MaxPassiveModeConfigLen);
	if (memcmp(RdrStaticSets_Marker, passbuf, pos) == 0)
	{
		int jsonlen = GetNumU16((uint8 *)passbuf+pos);
		int vlret;
		pos += 2;
		vlret = valid_static_settings(passbuf+pos, jsonlen, static_set);
		if (vlret != 0)
			setdef_rdr_static_settings(static_set);
		TRACE("get_rdr_static_settings valid_static_settings vlret:%d\n", vlret);
		free_hexp(passbuf);
		return vlret;
	}
	else
	{
		setdef_rdr_static_settings(static_set);
		TRACE("not find RdrStaticSets_Marker\n");
		free_hexp(passbuf);
		return -1;
	}
}

int get_workmode_params(WorkMode_Code *wmode)
{
	uint8 header[32];
	int pos = strlen(WorkModeParams_Marker);
	
	flash_bytes_read(WorkModeParams_Addr, header, 32);
	if (memcmp(header, WorkModeParams_Marker, strlen(WorkModeParams_Marker)) != 0)
		*wmode = WorkMode_Passive;
	else
		*wmode = (WorkMode_Code)GetNumU32(header+pos);
	return 0;
}

int set_workmode_params(WorkMode_Code wmode)
{
	int err = 0;
	ConfReadBuffer confBuf;
	int pos = strlen(WorkModeParams_Marker);
	
	E(pre_set_config(&confBuf));
	memcpy(confBuf.workmodeparambuf, WorkModeParams_Marker, pos);
	SetNumU32(confBuf.workmodeparambuf+pos, wmode);
	E(set_config_to_flash(&confBuf));
	
FIN:
	return err;	
}

void AppCustomParams_To_runtime_settings(AppCustomParams *pAppCusPara, 
	ReaderRunTimeSettings_ST *runtime_set)
{
	int i;
	runtime_set->glob_params.hb_cylce = pAppCusPara->heart_beat_cylce;
	memcpy(runtime_set->glob_params.name, pAppCusPara->name, pAppCusPara->name_len);
	runtime_set->glob_params.name[pAppCusPara->name_len] = 0;
	runtime_set->glob_params.s_buf_size = 512;
	/*
	for (i = 0; i < 16; ++i)
		runtime_set->inventory.ants[i] = 0;
	for (i = 0; i < pAppCusPara->invants_len; ++i)
		runtime_set->inventory.ants[pAppCusPara->inv_ants[i]-1] = 1;

	runtime_set->inventory.cycle = pAppCusPara->inv_cycle;
	runtime_set->inventory.interval = pAppCusPara->interval_cycle;
	runtime_set->inventory.inv_mode = 0;
	
