deeprfid/Scanner_Decoder/hc32f46_driver/trunk/user/src/readercfg.c
int set_bluetooth_config(BluetoothConfig_ST *blest)
{
	int err = 0;
	ConfReadBuffer confBuf;
	int pos = strlen(BluetoothConfig_Marker);
	char *jstart;
	int jlen;
	E(pre_set_config(&confBuf));
	memcpy(confBuf.bluetoothcfgbuf, BluetoothConfig_Marker, pos);
	jstart = (char *)confBuf.bluetoothcfgbuf+pos+2;
	
	tojson_bluetooth_config(blest, jstart, &jlen);

	SetNumU16(confBuf.bluetoothcfgbuf+pos, jlen);
	E(set_config_to_flash(&confBuf));
FIN:
	return err;	
}

int set_wlan_config(WlanConfig_ST *wlanst)
{
	int err = 0;
	ConfReadBuffer confBuf;
	int pos = strlen(WifiConfig_Marker);
	char *jstart;
	int jlen;
	E(pre_set_config(&confBuf));
	memcpy(confBuf.wificfgbuf, WifiConfig_Marker, pos);
	jstart = (char *)confBuf.wificfgbuf+pos+2;
	
	tojson_wlan_config(wlanst, jstart, &jlen);

	SetNumU16(confBuf.wificfgbuf+pos, jlen);
	E(set_config_to_flash(&confBuf));
FIN:
	return err;
}

int set_board_compos(Spi_Ex_Code spiex, Uart_Ex_Code uart1ex)
{
	int err = 0;
	ConfReadBuffer confBuf;
	int pos = strlen(HwTypeConfig_Marker);
	E(pre_set_config(&confBuf));
	memcpy(confBuf.hwtypecfgbuf, HwTypeConfig_Marker, pos);
	confBuf.hwtypecfgbuf[pos++] = spiex;
	confBuf.hwtypecfgbuf[pos++] = uart1ex;
	E(set_config_to_flash(&confBuf));
FIN:
	return err;	
}

int valid_upfw_ftp_params(json_value *pobj, BtParams_ST *btparams)
{
	int pvalint;
	int exflag;
	int tmpmode;
	
	PARSE_CHK_RANGE(pobj, "mode", tmpmode, 1, 2, 1);
	
	if (exflag == 1)
		btparams->updatemode = (FwUpdateModeCode)tmpmode;

	PARSE_CHK_STR(pobj, "server", btparams->ftpaddr, BTFWUPD_FTP_SERADDR_BUFLEN, 1, 0);
	
	PARSE_CHK_STR(pobj, "user", btparams->ftpuser, BTFWUPD_FTP_USER_BUFLEN, 1, 1);
	
	PARSE_CHK_STR(pobj, "pwd", btparams->ftppassword, BTFWUPD_FTP_PASSWORD_BUFLEN, 1, 1);

	PARSE_CHK_STR(pobj, "path", btparams->filename, BTFWUPD_FTP_FILENAME_BUFLEN, 1, 0);

	if (btparams->updatemode == FwUpdateMode_ByFtp_FmEth)
	{
		if (get_spi_ex_dev() != Spi_Ex_Ethernet)
			return -1;
	}
	else if (btparams->updatemode == FwUpdateMode_ByFtp_Fm4G)
	{
		if (get_uart_ex_dev() != Uart_Ex_4G)
			return -1;		
	}
	
	return 0;
}

#endif


